{"status": "success", "totalResults": 406, "results": [{"article_id": "38833db078f71dc47c14beb83cd91bb8", "title": "Elon Musk urges people to have more babies at right-wing festival", "link": "https://www.thepinknews.com/2023/12/17/elon-musk-babies-culture-population-italy-far-right-event/", "keywords": ["Europe", "News", "Politics", "US", "World", "elon musk", "Giorgia Meloni", "Italy", "Parenting"], "creator": ["Maggie Baska"], "video_url": null, "description": "Elon Musk claimed people should have more babies to ensure their “culture” doesn’t “disappear” before raging about a “woke” virus at a right-wing event in Italy. The billionaire attended the Atreju festival, which was hosted by the far-right Brothers of Italy party of Italian prime minister Giorgia Meloni, on Saturday (16 December) in Rome. Musk […] The post Elon Musk urges people to have more babies at right-wing festival appeared first on PinkNews | Latest lesbian, gay, bi and trans news | LGBTQ+ news.", "content": "Elon Musk claimed people should have more babies to ensure their “culture” doesn’t “disappear” before raging about a “woke” virus at a right-wing event in Italy. The billionaire attended the Atreju festival, which was hosted by the far-right Brothers of Italy party of Italian prime minister Giorgia Meloni, on Saturday (16 December) in Rome. Musk previously travelled to the Italian capital in June to meet with Meloni, who has , to discuss the dangers of artificial intelligence and Italy’s declining population. Italy has one of the lowest birth rates in the world. Musk, who has 11 children, took to the Atreju stage with one of his kids to claim that having more children is the only way to reverse the population decline in Italy and other industrialised countries. If people didn’t have more babies, Elon Musk alleged the somehow. “We are in danger of no longer having these countries,” the billionaire Tesla owner said. Meloni’s right-wing coalition government – which includes Matteo Salvini’s far-right League and former PM Silvio Berlusconi’s centre-right Forza Italia – has been preoccupied with addressing Italy’s population decline, and has earmarked around €1 billion for measures in support of families with children. Yet, Meloni has made it her mission to attack LGBTQ+ families who have children. The prime minister has demanded Italian councils , only registering biological parents on the document. The move left same-sex couples in and rightfully fearful for their families’ futures in the country. A lesbian mum was devastated by the removal of her name from her child’s birth certificate, and she urged the government to think about all the families because of these hateful policies. In August, protestors gathered outside the Italian embassy in London to show solidarity for the country’s LGBTQ+ community and . Giorgia Meloni has also publicly opposed surrogacy and adoption by queer couples. Her right-wing government is cracking down on gestational surrogacy – a practice already outlawed in Italy – and . Those found guilty could face a two-year jail sentence and a massive €1 million fine. Meloni reportedly made no mention of Musk in 2021. On top of asking people to have more babies, Elon Musk raged about a “woke mind virus” that he believes is gripping the US. It’s something he’s been . When asked about , Elon Musk said he “will do well” and believed the mass exodus is a “short-term problem”. He then suggested those who have left the social media platform were infected with a so-called “woke” virus. On 3 December, Elon Musk attempted to . It came after several big brands including Apple and Disney joined a from Musk’s X/Twitter after the billionaire businessman replied to a post sharing an antisemitic conspiracy theory,", "pubDate": "2023-12-17 15:41:21", "image_url": "https://www.thepinknews.com/wp-content/uploads/2023/12/elon-musk-right-wing-festival-speech-italy-babies-child.jpg?w=150", "source_id": "pinknews", "source_priority": 4786338, "country": ["united kingdom"], "category": ["top"], "language": "english"}, {"article_id": "4537fb7491186ab9711557e98f1fefb8", "title": "‘The damage is done’: Experts warn Gaza has reached the point of no return", "link": "https://www.independent.co.uk/news/world/middle-east/gaza-israel-bombing-west-bank-b2464342.html", "keywords": ["Middle East", "World"], "creator": ["Maira Butt"], "video_url": null, "description": "UN officials warn damage done by Israel since Hamas’ deadly 7 October attacks is now ‘irreversible’, Maira Butt reports", "content": "H ouses, medical facilities, schools, shops, water, electricity and fuel. Basic building blocks of everyday life that have been obliterated in many areas of the Gaza Strip as the Israeli bombardment following Hamas’ deadly 7 October attacks stretches into its third month. With US president Joe Biden this week pointedly calling out the Israel military’s ‘indiscriminate bombing, many Palestinians feel that whatever happens next may be too little too late. “The damage is done,” says Palestinian lawyer Diana Buttu, former legal adviser to the Palestinian Liberation Organisation (PLO). “ Gaza is now beyond repair. The physical damage cannot be fixed.” Ms Buttu, who worked with the PLO and Israeli governments during the final Israeli-Palestinian peace talks between 2000 and 2004, believes the conflict has reached a point of no return. “Let’s assume the bombing stops tomorrow,” she said. “Most homes are uninhabitable – where do you send all these people? How do you provide for them? Where are the shops, the schools, the universities, the hospitals? “It will take years to even get to a place resembling a life, where do people go in the meantime?” The United Nations said on Tuesday it had used its satellite analysis agency UNOSAT to determine that 18 per cent of Gaza’s infrastructure had been destroyed since the October attacks. This includes at least 60 per cent of all housing units according to the UN’s Office for the Coordination of Humanitarian Affairs and 50 per cent of all infrastructure in the north of the strip. This infrastructure includes homes, hospitals, schools, universities and mosques. More than 77 per cent of Gazan hospitals are now non-operational according to the World Health Organisation and nine out of 10 Palestinians do not eat every day according to the World Food Programme. More than 85 per cent of the population, some 1.9 million people, are believed to have been displaced. And the breakdown of civilian infrastructure is bringing with it an impending breakdown of Palestinian society, it has been warned. “We are witnessing the beginning of the breakdown of civil order,” an UNRWA spokesperson told The Independent . “People are extremely anxious, extremely hungry, extremely scared. People have been going into one of our main food distribution shelters in Khan Yunis and fending for themselves. “That speaks volumes about their level of anxiety but also that it isn’t possible anymore to conduct a proper, organised humanitarian operation. People are too scared, upset, angry and distressed – everyone is in survival mode.” The Israeli Defence Forces have been adamant its military objectives are to eradicate Hamas, arguing the group uses Palestinian civilians as human shields in hospitals, homes and schools and that it is essential to ensure the national security of Israel. Mark Regev, a senior adviser to Israeli Prime Minister Benjamin Netanyahu, said on Thursday: “The idea that Israel is somehow indiscriminately carpet bombing Gaza, this is simply just not true“. A spokesperson for Israeli human rights organisation B’Tselem said: “Everything we’ve seen in the last two months, we haven’t seen before. “The scale and intensity of everything in Gaza and the West Bank as well as the intensity of Hamas crimes on October 7. Some of our Jewish and Israeli staff lost loved ones. A lot of people across the region are handling trauma and mourning right now. “All of this is worse than we’ve ever seen, there’s no question about it. But we can’t go back to where we were before, which was an apartheid state.” Human Rights Watch, Amnesty International and various UN officials have concluded Israel as committing apartheid in their investigations, a claim that Israel vehemently denies and has called antisemitic. But the question of what Palestinians will come back to remains. Juliette Touma, a Director at the United Nations Relief and Works Agency told The Independent that Gaza is “becoming unliveable”. She said: “This is the most challenging moment in the history of the UN for a number of medical reasons, but for UNRWA it’s the most challenging moment in the 75-year history of the agency. People in Gaza have reached their darkest hour. “It’s not even comparable to any of the conflicts that Gaza has had. This is no place for children, no place for human beings. They are living in a hellhole.”", "pubDate": "2023-12-17 15:26:11", "image_url": "https://static.independent.co.uk/2023/12/15/12/1848861716.jpg?width=1200&auto=webp", "source_id": "independentuk", "source_priority": 290, "country": ["united kingdom"], "category": ["world"], "language": "english"}, {"article_id": "99716278e5604ff21357e875c2feffbe", "title": "Canada: Amidst online Hinduphobic attacks on the new 55-feet Lord Hanuman statue in Brampton, temple decides to enhance security", "link": "https://www.opindia.com/2023/12/new-hanuman-statue-in-brampton-receives-hatred-from-canadians/", "keywords": ["News Reports", "World", "Brampton", "Canada", "Hindu temple attack", "Hinduphobia"], "creator": ["OpIndia Staff"], "video_url": null, "description": "A section of Canadian netizens have unleashed a bigoted attack on the Hindu community over a new statue of Lord Hanuman in Brampton", "content": "OpIndia bringing the \\'right\\' side of India OpIndia bringing the \\'right\\' side of India Sunday, December 17, 2023 Latest News About Us Contact Us Write for Us MyVoice Facebook Instagram RSS Twitter Youtube OpIndia bringing the \\'right\\' side of India Politics Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... As TV reporters shamelessly fight for smoke canister thrown in Parliament, here are a few things we should all be worried about after witnessing... Chadar of sanitised history over ugly side of ‘Sufi saints’: I got death threats by Islamists for talking about historical facts – so let... Antisemitism is not new to US campuses including Ivy Leagues, their credibility is questionable for more reasons than one. Here’s why How The Hindu consoled itself and shielded Rahul Gandhi after electoral drubbing in 3 states: Blaming regional leaders, voters, Hindutva and more Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... Press release announcing Mahanth Balaknath Yogi as next CM of Rajasthan is fake: State BJP NDTV fact-checks Congress’ Supriya Srinate, says they did not conduct any ‘poll of polls’ for Telangana Media Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... Parliament security breach mastermind Lalit Jha arrested, had fled to Rajasthan News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... ‘Parliament me toh apne hi log gaye hain’: Leftist journalist Anil Sinha supports the accused in parliament security breach case Variety All Books Culture and History Satire WTF News ‘Loo break’: Vivek Ramaswamy faces an awkward hot mic moment during active Space on X with 2.3 million listeners, Elon Musk quips ‘Hope you... Uttar Pradesh: Kashi Vishwanath Dham welcomes record 12.9 crore devotees in 2 years since the inauguration of the temple corridor High priest to lead the consecration ceremony of Ram Mandir in Ayodhya is a descendant of priest who presided over the coronation of Chhatrapati... Gujarat’s Garba declared an Intangible Cultural Heritage by UNESCO Specials All Interviews OpIndia Explains OpIndia Scoops PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train Who is Shahrukh Pathan’s father: Convicted for 10 years over drug peddling, evidence of collusion with Pakistanis and more ‘They came in a vehicle with no number plates, set fire on Bittu Bajrangi’s brother’: Arman had earlier burned his own shop to blame... Pune: Govt land in Kondhwa’s Hindu locality allotted for playground being converted into Muslim ‘Qabristan’, residents complain. Here’s all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં Search OpIndia bringing the \\'right\\' side of India Politics News Reports Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral Politics Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... News Reports Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... News Reports ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain Opinions Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... Opinions As TV reporters shamelessly fight for smoke canister thrown in Parliament, here are a few things we should all be worried about after witnessing... Opinions Chadar of sanitised history over ugly side of ‘Sufi saints’: I got death threats by Islamists for talking about historical facts – so let... Opinions Antisemitism is not new to US campuses including Ivy Leagues, their credibility is questionable for more reasons than one. Here’s why Opinions How The Hindu consoled itself and shielded Rahul Gandhi after electoral drubbing in 3 states: Blaming regional leaders, voters, Hindutva and more Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check News Reports Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz News Reports News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... News Reports Press release announcing Mahanth Balaknath Yogi as next CM of Rajasthan is fake: State BJP News Reports NDTV fact-checks Congress’ Supriya Srinate, says they did not conduct any ‘poll of polls’ for Telangana Media News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... News Reports Parliament security breach mastermind Lalit Jha arrested, had fled to Rajasthan News Reports News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... News Reports ‘Parliament me toh apne hi log gaye hain’: Leftist journalist Anil Sinha supports the accused in parliament security breach case Variety All Books Culture and History Satire WTF News News Reports ‘Loo break’: Vivek Ramaswamy faces an awkward hot mic moment during active Space on X with 2.3 million listeners, Elon Musk quips ‘Hope you... News Reports Uttar Pradesh: Kashi Vishwanath Dham welcomes record 12.9 crore devotees in 2 years since the inauguration of the temple corridor News Reports High priest to lead the consecration ceremony of Ram Mandir in Ayodhya is a descendant of priest who presided over the coronation of Chhatrapati... Culture and History Gujarat’s Garba declared an Intangible Cultural Heritage by UNESCO Specials All Interviews OpIndia Explains OpIndia Scoops News Reports PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train News Reports Who is Shahrukh Pathan’s father: Convicted for 10 years over drug peddling, evidence of collusion with Pakistanis and more News Reports ‘They came in a vehicle with no number plates, set fire on Bittu Bajrangi’s brother’: Arman had earlier burned his own shop to blame... News Reports Pune: Govt land in Kondhwa’s Hindu locality allotted for playground being converted into Muslim ‘Qabristan’, residents complain. Here’s all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં More Search Home News Reports Canada: Amidst online Hinduphobic attacks on the new 55-feet Lord Hanuman statue in Brampton,... News Reports World Updated: 17 December, 2023 Canada: Amidst online Hinduphobic attacks on the new 55-feet Lord Hanuman statue in Brampton, temple decides to enhance security The Hindu Sabha Mandir in Brampton is constructing a 55-foot-tall statue of the Hindu deity Hanuman, which will be inaugurated in April next year to commemorate Hanuman Jayanti. 17 December, 2023 OpIndia Staff Facebook Twitter Telegram Email WhatsApp 6 A temple in Canada’s Greater Toronto Area (GTA) is increasing security after receiving complaints and discriminatory remarks on social media about a massive statue of Lord Hanuman being put up on its grounds. The Hindu Sabha Mandir in Brampton is constructing a 55-foot-tall statue of the Hindu deity Hanuman, which will be inaugurated in April next year to commemorate Hanuman Jayanti. According to a temple priest, the statue is 95% finished, with minor work on the pedestal remaining. Notably, in recent months Brampton has seen a surge in pro-Khalistan activity. In July, “ War Zone ” posters threatening Indian diplomats in Canada appeared outside the Bharat Mata Mandir in Brampton. Known for his expertise in sculpting Hindu deities, Rajasthan sculptor Naresh Kumawat is creating the Lord Hanuman statue. Kumawat has erected over 200 statues in more than 80 countries. Speaking to Hindustan Times, the temple priest Phool Kumar Sharma said , “There is security at our temple, and we will be keeping watch at night as well.” Sharma stated that there have been complaints to the authorities as well as social media outrage by some people who are discontented with the statue’s installation. The priest, however, clarified that the statue is sponsored by donations, is being made on the temple grounds and does not violate any municipal regulations. Notably, a section of Canadian netizens have unleashed a bigoted attack on the Hindu community over the statue of Lord Hanuman with many posting derogatory comments about Hindu Canadians and the Hindu gods as well. One Cosmin Dzsurdzsa wrote, “Hinduism is heavily invested in the meaning and power of symbols. Although Western thought has largely discounted religious symbolism as irrational and superstitious, ignoring an obvious projection of power in the form of a massive deific monument will be to our detriment. Why would somebody feel the need to erect a 50-foot idol outside for non-believers to see and not in a temple? The psychological motivation is curious and a legitimate question.” Why would somebody feel the need to erect a 50 foot idol outside for non-believers to see and not in a temple? The psychological motivation is curious and a legitimate question. — Cosmin Dzsurdzsa 🇷🇴 (@cosminDZS) December 15, 2023 Another one wrote, “The Libertarian ideas that are used to defend this eye sore of a statue are exactly what needs to die in the Canadian Right Wing. If you’re not fighting to defend Canadian culture & Canadian people then you’re honestly not helping.” The Libertarian ideas that are used to defend this eye sore of a statue are exactly what needs to die in the Canadian Right Wing. If you're not fighting to defend Canadian culture & Canadian people then you're honestly not helping. pic.twitter.com/odwVWoxVvt — Greg Wycliffe (@gddub) December 15, 2023 One Harrison Faulkner wrote, “Canada in 2023. Toronto: John A. Macdonald statue at Queen’s Park in a wooden box for over 2 years. Brampton: A brand new 55-foot-tall statue of Hanuman, the Hindu monkey commander of the monkey army.” Canada in 2023. Toronto: John A. Macdonald statue at Queen's Park in a wooden box for over 2 years. Brampton: A brand new 55-foot-tall statue of Hanuman, the Hindu monkey commander of the monkey army. pic.twitter.com/6HJNne59Ht — Harrison Faulkner (@Harry__Faulkner) December 14, 2023 Another one wrote, “Countless Canadians are noticing huge changes in their country that they don’t like. It’s completely valid that they feel this way. There’s nothing wrong with thinking that things were better decades ago. Traditional Canadian culture is being erased, and people aren’t happy.” Countless Canadians are noticing huge changes in their country that they don't like. It's completely valid that they feel this way. There's nothing wrong with thinking that things were better decades ago. Traditional Canadian culture is being erased, and people aren't happy. https://t.co/sS95zvwsPO — Joe Blo (@NormalGuy223) December 15, 2023 The same person had in a now-deleted post written, “A 55-foot Hindu statue is going up in Brampton, Ontario….which is another reminder that we need an immediate halt on all immigration into Canada.” Amusingly, the person opines that a mere statue of Lord Hanuman installed on a private property has power to ‘erase’ the ‘Traditional Canadian culture’. It is ironic that Canadians who day in and out boast to be the most tolerant and champions of religious freedom and free speech and whatnot are offended by a Hindu deity’s statue being built on private land in absolute compliance with the local laws. The recent online attacks only expose the deep-seated hatred for the Hindu faith and Hindus in general. If we look at the data, according to a 2021 census , Canada has a Christian population of over 19.3 million making up over half of the Canadian population. It is interesting to note that India, a Hindu majority country is home to more Christians than a Christian majority Canada with a population of over 28 million, according to 2011 census data, making them the third largest religious community in the country. Despite being a Hindu majority nation, India has always been tolerant towards religious institutions, places of worship, statues etc. When Hindu temples are attacked by Khalistani terrorists, the same intolerant Canadians go into hibernation, yet go berserk over a 55-foot statue of a Hindu god, claiming that Hindu religious symbolism is being forced in a Christian-majority Canada. In recent months, Khalistani terrorists have attacked Hindu temples in several parts of Canada, vandalising the temples and defacing the walls with anti-India and anti-Hindu graffiti, with Canadian authorities taking no concrete action. The question arises as to how one immigrant community, whose places of worship are constantly subjected to hatred and attacks by extremist sections of another and yet remains law-abiding, will obliterate or destroy “Canadian culture,” which it does not seek to do. Support Us Whether NDTV or 'The Wire', they never have to worry about funds. In name of saving democracy, they get money from various sources. We need your support to fight them. Please contribute whatever you can afford Pay Topics Brampton Canada Hindu temple attack Hinduphobia OpIndia Staff https://www.opindia.com Staff reporter at OpIndia Share on : Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Koo (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on Telegram (Opens in new window) Click to share on WhatsApp (Opens in new window) Related Articles Trending now Politics Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress OpIndia Staff - 17 December, 2023 This is not the first time Congress and AAP have come face-to-face over seat sharing in Punjab. On 12th December, Punjab Congress chief Amarinder Singh Raja Warring said that his party would contest all 13 Lok Sabha seats in Punjab. News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... OpIndia Staff - 17 December, 2023 At a time when the grand-old-party is under scanner over allegations of corruption, Rajdeep Sardesai was seen making a last-ditch effort to give a clean chit to the Congress' high command. Porn scandal rocks US Capitol: Democrat Senator Ben Cardin’s legal aide fired after filming gay sex tape in Senate Hearing room 17 December, 2023 Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz 17 December, 2023 Eyes gouged out, genitals mutilated, tongue chopped off: Shiv Temple Pujari, who was missing in Bihar for 5 days, found dead 17 December, 2023 CCP-linked outfit ‘The People’s Forum’, known for fuelling Kashmiri separatism and anti-India propaganda, saw 803% increase in funding 17 December, 2023 Recently Popular News Reports Aishwarya Rai Bachchan moves out of the Bachchan home over rift with in-laws, has not spoken with Jaya Bachchan for years: Report OpIndia Staff - 15 December, 2023 News Reports ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain OpIndia Staff - 17 December, 2023 News Reports I don’t feel safe here, can’t even go to a park without being harassed: Pakistani actress Ayesha Omar exposes the ugly truth of her... OpIndia Staff - 16 December, 2023 News Reports ‘I kept sending him money, he kept claiming payment failures’: How a Bengaluru techie lost Rs 68 lakhs trying to sell a used bed... OpIndia Staff - 15 December, 2023 News Reports Sajjan Jindal of the JSW group booked in a rape case filed by an actress, FIR registered in Mumbai after court order OpIndia Staff - 17 December, 2023 News Reports Bengaluru: Christian event ‘Pray for India’ by a foreign pastor cancelled over possible visa rule violations OpIndia Staff - 15 December, 2023 - Advertisement - Latest News Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral OpIndia Staff - I’m sorry for making reels at railway platforms: Instagram content creator apologises after viral dance at Andheri station draws police attention OpIndia Staff - Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress OpIndia Staff - Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... OpIndia Staff - Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... OpIndia Staff - Parliament Security Breach: Lalit Jha shared the video of the intrusion with a friend from Bengal urging him to circulate it OpIndia Staff - Porn scandal rocks US Capitol: Democrat Senator Ben Cardin’s legal aide fired after filming gay sex tape in Senate Hearing room OpIndia Staff - King of Bhutan thanks PM Modi and India for support in rail network during his National Day address OpIndia Staff - PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train OpIndia Staff - ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain OpIndia Staff - Read all the latest news Connect with us 255,564 Fans Like 665,518 Followers Follow 38,000 Subscribers Subscribe Subscribe to our Newsletter Each morning, get an email to keep updated with all the news, opinions and analysis published by OpIndia. Enter your email address: Browse by months Browse by months Select Month December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 Contact: [email protected] About us News and opinion website that brings you reports and narrative from a perspective often ignored or suppressed by the mainstream media of India. Follow us Facebook Instagram RSS Twitter Youtube © OpIndia.com Latest News Hindi News MyVoice Terms Privacy Policy About Us Contact Us", "pubDate": "2023-12-17 15:17:05", "image_url": "https://i0.wp.com/www.opindia.com/wp-content/uploads/2023/12/Hanuman-statue-canada-brampton.jpg?fit=696%2C403&ssl=1", "source_id": "opindia", "source_priority": 37271, "country": ["india"], "category": ["world"], "language": "english"}, {"article_id": "f6eecd6560e7aeb3133e713d1f9e56b0", "title": "Not just college campuses: Tensions from Israel-Gaza war spill into U.S. public schools", "link": "https://www.haaretz.com/us-news/2023-12-17/ty-article-magazine/.premium/not-just-college-campuses-tensions-from-israel-gaza-war-spill-into-u-s-public-schools/0000018c-7733-df88-a39c-77b395160000", "keywords": null, "creator": ["Judy Maltz"], "video_url": null, "description": "There has been a marked increase in antisemitic incidents in U.S. elementary schools and high schools since October 7, with students and parents concerned about the spiking antisemitism and anti-Israel confrontations, and about what children are being taught", "content": "NEW YORK – The first signs of trouble were the swastika and the \"Heil Hitler\" drawn on a bathroom wall. But what really horrified Jewish students at this Los Angeles public school was the eighth-grader who stormed into their weekly religious club meeting screaming \"Kill all the Jews.\"", "pubDate": "2023-12-17 14:35:07", "image_url": "https://img.haarets.co.il/bs/0000018c-7826-d55c-a7cc-fb26abe60001/88/57/17ba0e094e2798e7b3866c1b22e8/ap23125458774007.jpg?width=108&height=81", "source_id": "haaretz_is", "source_priority": 9051, "country": ["israel"], "category": ["world"], "language": "english"}, {"article_id": "7f03886afd38db39ac6f291aab42f9c4", "title": "Berlin club refuses to host 'Jewish' event, citing 'current state of affairs'", "link": "https://www.haaretz.com/world-news/europe/2023-12-17/ty-article/.premium/berlin-club-refuses-to-host-jewish-event-citing-current-state-of-affairs/0000018c-77b9-d1e1-a3ae-77bd396e0000", "keywords": null, "creator": ["Ofer Aderet"], "video_url": null, "description": "The club later agreed to host the Purim party, apologizing for 'the clearly antisemitic statement in the email from our employee' after being contacted by Haaretz", "content": "A Berlin club that refused to host a Purim party – writing that they find it \"incredible\" that the event organizer is \"willing to celebrate a Jewish carnival given the current state of affairs\" – later apologized for their employee's antisemitic statement.", "pubDate": "2023-12-17 14:30:09", "image_url": "https://img.haarets.co.il/bs/0000018c-7806-d382-a19e-fa3ff0bd0000/fa/c5/7bf2bcaf4a20b69dd224d129d99e/40445.jpg?width=108&height=81", "source_id": "haaretz_is", "source_priority": 9051, "country": ["israel"], "category": ["world"], "language": "english"}, {"article_id": "9a9f7764c818b0809a18aff21a16f9ae", "title": "Feasibility of two-state solution has increased since Israel-Hamas war started: Joly", "link": "https://www.ctvnews.ca/politics/feasibility-of-two-state-solution-has-increased-since-israel-hamas-war-started-joly-1.6690591", "keywords": null, "creator": ["Spencer Van Dyk"], "video_url": null, "description": "Foreign Affairs Minister Melanie Joly says she believes a two-state solution to the Israel-Palestinian conflict is more possible to achieve now than before the Israel-Hamas war began more than two months ago.", "content": "Foreign Affairs Minister Melanie Joly says she believes a two-state solution to the Israel-Palestinian conflict is more possible to achieve now than before the Israel-Hamas war began more than two months ago. When asked by CTV’s Question Period host Vassy Kapelos in an interview airing Sunday whether she thinks the feasibility of a two-state solution has diminished since Hamas attacked Israel on Oct. 7, Joly said she thinks “the contrary.” “I think because this conflict is so difficult for Israel, so difficult for the Palestinians, so difficult for the world, not only in Canada because we've seen the rise of antisemitism, the rise of Islamophobia and just the rise of tension,” she said. “But that's the case here, that's the case in Europe, that's the case south of the border, that's the case in Arab countries,” she added. “So more than ever, many, many countries are preoccupied by the state of the region.” Joly said she believes that was “not as much the case” before the Oct. 7 attacks, which have renewed a global focus on the Middle East, prompting her to have “many conversations” on the topic with her counterparts in the region, because “it is also in the interest of the world to see a two-state solution happening.” The Canadian government has been calling for a two-state solution in the region, renewing that push in a recent joint statement with Australia and New Zealand, which also calls for “efforts towards a sustainable ceasefire.” “We've also said that Hamas being a terrorist organization should not be involved in any future governance of Gaza,” Joly told Kapelos. “Because we believe that there is a path towards a two-state solution, and we need to make sure that we get to that two-state solution process.” When asked what she thinks of the feasibility of such a compromise becoming a sustainable reality — considering only about a third of Israelis and Palestinians believe it is possible, according to some polling — Joly said “there is no other choice.” “And there's no other path,” she said. “And we need to have a constructive government in Israel that believes in the two-state solution, and we need to have the right Palestinian voices, which are not Hamas, that believe in it.” “It's been 30 years that we've been talking about it, but there's been a lot of actions to undermine it, including on both sides,” she added. “And I think as Western leaders, we have to reckon that we haven't done a good job enough to bring this solution to the table, talking about it, but not enough actions.” Joly said she’s “committed” to doing the work and finding the “right parties at the table to give the right credibility,” to those discussions. Joly in her interview also discussed whether she believes Israel has breached international humanitarian law in its response to the Oct. 7 attacks by Hamas, and whether Canada may ever designate Iran’s Islamic Revolutionary Guard Corps a terrorist entity. Watch the full interview on CTV’s Question Period Sunday at 11 a.m. ET. With files from CTV’s Question Period Senior Producer Stephanie Ha", "pubDate": "2023-12-17 14:30:00", "image_url": null, "source_id": "ctvnews_ottawa", "source_priority": 7722, "country": ["canada"], "category": ["top"], "language": "english"}, {"article_id": "f4e7f7852226035558bd309f709c8386", "title": "Robby Starbuck Just DECIMATES Biden by Highlighting Exactly What 'Decency' Has Looked Like in His Admin", "link": "https://twitchy.com/samj/2023/12/17/list-of-biden-admin-decency-on-the-ballot-n2390901", "keywords": ["<![CDATA[Jill Biden]]>", "<![CDATA[Joe Biden]]>"], "creator": ["<![CDATA[Sam J.]]>"], "video_url": null, "description": null, "content": "You guys remember when Jill Biden tweeted about how having Joe on the ballot somehow meant 'decency' was coming back? Yeah, that was dumb. Anyone at all familiar with the Biden Crime/Corruption Family knew better way back then. These are not the most decent people. To be fair, not a lot of politicians are but Biden is especially gross. Hey, don't take our word for it ... just look at this laundry list of 'decent' activities that have taken part on his watch. Since this tweet: • Joe had a trans activist shake their fake breasts on the White House lawn • Cocaine found at the White House • Male Biden appointee steals Womens clothes at airports to wear them • Gay sex tape filmed in the Senate • Joe’s son had sex tapes go public and… And these are just the things we know. Probably pretty fair to say it only gets worse from here on out. Their decency looks an awful lot like degeneracy to me. Yeah, us too. Well at least there hasn't been any mean tweets. I miss mean tweets. Right? Those mean tweets were the REAL issue. Not some antisemitic staffer filming p0rn in a Senate Hearing Room. Sheesh. They have no shame. \"The adults are back\" Not to mention, the fentanyl, homelessness, trashed cities and public parks, looting, violence, and deleting the first and fourth amendments. ResToRiNg tHe sOuL of tHe NatiON! There it is. Do you guys feel all restored and stuff? Yeah, us too! That didn't age well! And neither has Jill. ====================================================================== Related: ======================================================================", "pubDate": "2023-12-17 14:20:00", "image_url": "https://media.townhall.com/cdn/hodl/tw/images/up/2023/351/c05aea0a-c2f3-419c-9985-83d211cd6780-650x0.jpg", "source_id": "twitchy", "source_priority": 14687, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "30fb97cdf07c7679905813a442c03d0c", "title": "Montevideo Late: Eli Almic se posicionó a favor de Palestina y causó polémica en redes", "link": "https://www.montevideo.com.uy/auc.aspx?874236", "keywords": ["Pantallazo"], "creator": ["Montevideo Portal"], "video_url": null, "description": "La rapera proyectó imágenes de la guerra y del primer ministro de Israel, Benjamin Netanyahu; fue criticada y halagada.", "content": "En el marco del festival Montevideo Late , que organizó la Intendencia de Montevideo (IM) este sábado 16, la rapera Eli Almic dio uno de los shows que más causaron polémica en redes sociales, así como también halagos. La cantante se posicionó a favor de Palestina y apuntó contra Israel: “Matar niñes no es defensa propia”, se leyó durante su actuación. Además, durante la canción “Sé que estás mintiendo” se pudo ver imágenes del primer ministro de Israel, Benjamin Netanyahu. En tanto, la artista también recordó que “en 60 días” de guerra, 21.731 palestinos murieron asesinados. El senador blanco Sebastián Da Silva escribió en su cuenta de X (antes Twitter): “¿Por qué hacen esto con la plata de los contribuyentes?”, en referencia a la presentación de la rapera. Porque hacen esto con la plata de los contribuyentes? pic.twitter.com/7tJcVFJIEG Por otro lado, el precandidato colorado Guzmán Acosta y Lara expresó: “Propaganda antisemita en el Montevideo Late, el festival que organiza la reina con dinero de los contribuyentes. Lamentable lo de esta mujer”. De este modo, cuestionó a la intendenta de Montevideo: “La verdadera pregunta es: ¿Uruguay soportaría cinco años de un gobierno conducido por Carolina Cosse y un Frente Amplio radicalizado?”. En tanto, el publicista Bruno Petcho también realizó un descargo en la red social. “Hoy Montevideo no late como debería haber latido”, comenzó. De acuerdo con el comunicdor, “el pulso de miles de ciudadanos se aceleró al escuchar como Eli Almic aprovechó un festival organizado por la Intendencia de Montevideo para seguir sembrando antisemitismo”. “Criticar políticas del gobierno de Israel no te hace antisemita. Pero cuando existe una intención clara de demonizarlo, esa crítica desmesurada o maniqueista, sí es una señal grave de antisemitismo”, apuntó. Petcho cuestionó: “¿Acaso a Eli Almic no le importa lo que está pasando hoy en Ucrania? ¿Armenia? ¿O en Irán? ¿En Yemen? ¿En Sudan? ¿En el Congo? ¿La cifra de muertes de palestinos en Siria no tuvo la suficiente cobertura mediática como para sobreimprimirla en su pantalla gigante? Fueron cientos de miles”. “Mientras Eli Almic cantaba su canción ‘Sé que estás mintiendo’ y cada vez que repetía el estribillo, la pantalla gigante acompañaba su voz con imágenes del primer ministro de Israel. Ya que estaba tan interesada en hablar de actualidad, la noche de hoy hubiese sido una buena oportunidad para condenar las atrocidades de Hamás mostrando alguno de los cientos de videos que los terroristas se hicieron violando, mutilando y asesinando israelíes y personas de todas partes, y así mostrarle al mundo de lo que son capaces estos fanáticos religiosos. Pero quizás ella piense que en eso los israelíes también están mintiendo”, agregó. Hoy Montevideo no late como debería haber latido. El pulso de miles de ciudadanos se aceleró al escuchar como Eli Almic aprovechó un festival organizado por la Intendencia de Montevideo para seguir sembrando antisemitismo en nuestra ciudad. Criticar políticas del gobierno de… Si bien la cantante fue duramente criticada, también se pudo ver en redes sociales comentarios en los que halagaban su posición política y su mensaje. En 2019, Eli Almic también protagonizó un polémico show, en el marco de la Movida Joven organizada por la IM . En aquel entonces, en la canción \"Sé que estás mintiendo\", la rapera usó imágenes de varias figuras políticas asociadas a la derecha, como Donald Trump, Jair Bolsonaro, Mauricio Macri y también Luis Alberto Lacalle Pou. En el caso de Lacalle, aparecen imágenes repetidas en las que el presidente electo se pasa los dedos por la nariz. La propia cantante contó en las redes sociales que recibió incluso amenazas de muerte por las visuales usadas en el show, aunque decidió luego borrar el comentario y agradeció el apoyo de muchas personas en el show. Por el momento, el intendente no realizará comentarios al respecto, según supo Montevideo Portal . Montevideo Portal", "pubDate": "2023-12-17 14:13:00", "image_url": "https://imagenes.montevideo.com.uy/imgnoticias/202312/_W620/866239.jpeg", "source_id": "futbol_uy", "source_priority": 261473, "country": ["uruguay"], "category": ["top"], "language": "spanish"}, {"article_id": "810b2e4f8adca6239dc653b22f016fc5", "title": "Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe started after video went viral", "link": "https://www.opindia.com/2023/12/doctors-seen-consuming-alcohol-during-paediatrics-conference-at-darbhanga-in-dry-state-bihar/", "keywords": ["News Reports", "Politics", "Alcohol", "Bihar", "viral video"], "creator": ["OpIndia Staff"], "video_url": null, "description": "Photos and visuals of doctors allegedly consuming alcohol at a party in the dry state of Bihar are doing rounds on social media", "content": "OpIndia bringing the \\'right\\' side of India OpIndia bringing the \\'right\\' side of India Sunday, December 17, 2023 Latest News About Us Contact Us Write for Us MyVoice Facebook Instagram RSS Twitter Youtube OpIndia bringing the \\'right\\' side of India Politics Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... As TV reporters shamelessly fight for smoke canister thrown in Parliament, here are a few things we should all be worried about after witnessing... Chadar of sanitised history over ugly side of ‘Sufi saints’: I got death threats by Islamists for talking about historical facts – so let... Antisemitism is not new to US campuses including Ivy Leagues, their credibility is questionable for more reasons than one. Here’s why How The Hindu consoled itself and shielded Rahul Gandhi after electoral drubbing in 3 states: Blaming regional leaders, voters, Hindutva and more Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... Press release announcing Mahanth Balaknath Yogi as next CM of Rajasthan is fake: State BJP NDTV fact-checks Congress’ Supriya Srinate, says they did not conduct any ‘poll of polls’ for Telangana Media Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... Parliament security breach mastermind Lalit Jha arrested, had fled to Rajasthan News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... ‘Parliament me toh apne hi log gaye hain’: Leftist journalist Anil Sinha supports the accused in parliament security breach case Variety All Books Culture and History Satire WTF News ‘Loo break’: Vivek Ramaswamy faces an awkward hot mic moment during active Space on X with 2.3 million listeners, Elon Musk quips ‘Hope you... Uttar Pradesh: Kashi Vishwanath Dham welcomes record 12.9 crore devotees in 2 years since the inauguration of the temple corridor High priest to lead the consecration ceremony of Ram Mandir in Ayodhya is a descendant of priest who presided over the coronation of Chhatrapati... Gujarat’s Garba declared an Intangible Cultural Heritage by UNESCO Specials All Interviews OpIndia Explains OpIndia Scoops PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train Who is Shahrukh Pathan’s father: Convicted for 10 years over drug peddling, evidence of collusion with Pakistanis and more ‘They came in a vehicle with no number plates, set fire on Bittu Bajrangi’s brother’: Arman had earlier burned his own shop to blame... Pune: Govt land in Kondhwa’s Hindu locality allotted for playground being converted into Muslim ‘Qabristan’, residents complain. Here’s all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં Search OpIndia bringing the \\'right\\' side of India Politics News Reports Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral Politics Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... News Reports Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... News Reports ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain Opinions Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... Opinions As TV reporters shamelessly fight for smoke canister thrown in Parliament, here are a few things we should all be worried about after witnessing... Opinions Chadar of sanitised history over ugly side of ‘Sufi saints’: I got death threats by Islamists for talking about historical facts – so let... Opinions Antisemitism is not new to US campuses including Ivy Leagues, their credibility is questionable for more reasons than one. Here’s why Opinions How The Hindu consoled itself and shielded Rahul Gandhi after electoral drubbing in 3 states: Blaming regional leaders, voters, Hindutva and more Fact-Check All Media Fact-Check Political Fact-Check Social Media Fact-Check News Reports Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz News Reports News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... News Reports Press release announcing Mahanth Balaknath Yogi as next CM of Rajasthan is fake: State BJP News Reports NDTV fact-checks Congress’ Supriya Srinate, says they did not conduct any ‘poll of polls’ for Telangana Media News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... News Reports Parliament security breach mastermind Lalit Jha arrested, had fled to Rajasthan News Reports News24 posts misleading tweet on Muslim sculptors making idol of Ram Lalla, here are the facts on the idols being made for the Ram... Opinions N Ram pats his own back for a pompous, gassy editorial in The Hindu, The Wire has a monumental meltdown: Fallout of SC decision... News Reports ‘Parliament me toh apne hi log gaye hain’: Leftist journalist Anil Sinha supports the accused in parliament security breach case Variety All Books Culture and History Satire WTF News News Reports ‘Loo break’: Vivek Ramaswamy faces an awkward hot mic moment during active Space on X with 2.3 million listeners, Elon Musk quips ‘Hope you... News Reports Uttar Pradesh: Kashi Vishwanath Dham welcomes record 12.9 crore devotees in 2 years since the inauguration of the temple corridor News Reports High priest to lead the consecration ceremony of Ram Mandir in Ayodhya is a descendant of priest who presided over the coronation of Chhatrapati... Culture and History Gujarat’s Garba declared an Intangible Cultural Heritage by UNESCO Specials All Interviews OpIndia Explains OpIndia Scoops News Reports PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train News Reports Who is Shahrukh Pathan’s father: Convicted for 10 years over drug peddling, evidence of collusion with Pakistanis and more News Reports ‘They came in a vehicle with no number plates, set fire on Bittu Bajrangi’s brother’: Arman had earlier burned his own shop to blame... News Reports Pune: Govt land in Kondhwa’s Hindu locality allotted for playground being converted into Muslim ‘Qabristan’, residents complain. Here’s all you need to know More… Social Media Entertainment Political History of India Government and Policy Economy and Finance Sports World Crime Law Support Us हिन्दी में ગુજરાતીમાં More Search Home News Reports Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state,... News Reports Politics Updated: 17 December, 2023 Bihar: Doctors seen consuming alcohol during Paediatrics conference at Darbhanga in the dry state, probe ordered after video went viral Darbhanga’s Sub-Divisional Police Officer, Amit Kumar confirmed the authenticity of the viral visuals. He stated that raids were conducted at DMCH after the video emerged, leading to the recovery of three bottles of foreign-made liquor. 17 December, 2023 OpIndia Staff Video of doctors partying with alcohol in the dry state of Bihar goes viral (Image Source - Pappu Yadav's X handle) Facebook Twitter Telegram Email WhatsApp 8 On 17th December (Sunday), photos and visuals of doctors allegedly consuming alcohol at a party in the dry state of Bihar started doing rounds on social media platforms. The incident of doctors partying with alcohol reportedly took place inside the guest house of Darbhanga Medical College and Hospital (DMCH). However, it was interrupted when someone barged in with a camera. As per reports, the party took place during the ongoing conference of paediatricians, Pedicon 2023, which is being organised at DMCH between 14-17 December. Notably, the visuals of the alcohol party were captured on camera. The footage revealed sealed imported liquor bottles abandoned on the floor after those consuming it quickly dispersed upon noticing the camera. After the visuals of medical professionals consuming alcohol in the dry state went viral, the Darbhanga Police sprung into action. Speaking with India Today TV, Darbhanga’s Sub-Divisional Police Officer, Amit Kumar confirmed the authenticity of the viral visuals. He stated that raids were conducted at DMCH after the video emerged, leading to the recovery of three bottles of foreign-made liquor. Kumar said , “It is claimed that a liquor party was organised on the DMCH campus. All video evidence will be examined and people concerned questioned.” Following the viral videos, opposition leaders launched a scathing attack on the Bihar government’s claim of making Bihar a dry state. Sharing photographs of the incident, Jan Adhikar Party (JAP) chief Pappu Yadav alleged that the Darbhanga Medical College and Hospital (DMCH) served as an “adda for sharab, shabab and Kabab (hub for women, wine & dine)”. He also claimed that he saw it firsthand when he was taken for treatment while in jail. बिहार में ग़रीबों के शराबबंदी का अलग क़ानून है और DMCH के प्रिंसिपल और डॉक्टरों के लिए अलग क़ानून है क्या? दरभंगा में पेडिकॉन कांफ्रेंस में शराब परोसी जा रही थी। डॉक्टर लोग लुत्फ़ उठा रहे थे, प्रशासन सोई हुई थी, आख़िर कब तक यह चलेगा?? मुख्यमंत्री जी @NitishKumar जी संज्ञान लें pic.twitter.com/vOIHVNGcRL — Pappu Yadav (@pappuyadavjapl) December 16, 2023 As per reports, the doctors caught in the viral frame included DMCH Principal Dr KN Mishra who outrightly denied the allegations. He claimed that he did not consume any alcohol and if anyone proves this, he will immediately leave his post. Regarding his presence at the alcohol party caught in the viral videos, he argued that someone had misused his photo and video as people could find his photo and video somewhere. According to him, the photo looks edited and he got information from news channels and newspapers. At the Pedicon conference, many doctors have come from Delhi, Mumbai, and Gujarat, for whom arrangements have been made to stay in many hotels and guest houses in the city. Now it is not possible to check their luggage, he further argued in his defence. He added that now that the incident has come to light, they are forming three to four investigation committees. This committee will investigate and submit a report in three days as to how and by whom the liquor was brought to the guest house. Presently Pedicon is going on in the guest house in which more than 509 doctors have come from outside. Regarding Pappu Yadav’s allegations of setting up a liquor den, the DMCH principal added that if any doctor is caught drinking or sees someone drinking then they should tell the hospital authorities. He added that the Pedicon is not an organisation of DMCH, it is organised by the Indian Academy of Pediatrics (IAP). In this institution, there are four times more doctors from outside Darbhanga than the number of doctors there, he added. It is important to note that Bihar Chief Minister Nitish Kumar imposed a ban on alcohol consumption in 2016, making it a dry state. Support Us Whether NDTV or 'The Wire', they never have to worry about funds. In name of saving democracy, they get money from various sources. We need your support to fight them. Please contribute whatever you can afford Pay Topics Alcohol Bihar viral video OpIndia Staff https://www.opindia.com Staff reporter at OpIndia Share on : Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Koo (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on Telegram (Opens in new window) Click to share on WhatsApp (Opens in new window) Related Articles Trending now Politics Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress OpIndia Staff - 17 December, 2023 This is not the first time Congress and AAP have come face-to-face over seat sharing in Punjab. On 12th December, Punjab Congress chief Amarinder Singh Raja Warring said that his party would contest all 13 Lok Sabha seats in Punjab. News Reports Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... OpIndia Staff - 17 December, 2023 At a time when the grand-old-party is under scanner over allegations of corruption, Rajdeep Sardesai was seen making a last-ditch effort to give a clean chit to the Congress' high command. Porn scandal rocks US Capitol: Democrat Senator Ben Cardin’s legal aide fired after filming gay sex tape in Senate Hearing room 17 December, 2023 Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz 17 December, 2023 Eyes gouged out, genitals mutilated, tongue chopped off: Shiv Temple Pujari, who was missing in Bihar for 5 days, found dead 17 December, 2023 CCP-linked outfit ‘The People’s Forum’, known for fuelling Kashmiri separatism and anti-India propaganda, saw 803% increase in funding 17 December, 2023 Recently Popular News Reports Aishwarya Rai Bachchan moves out of the Bachchan home over rift with in-laws, has not spoken with Jaya Bachchan for years: Report OpIndia Staff - 15 December, 2023 News Reports I don’t feel safe here, can’t even go to a park without being harassed: Pakistani actress Ayesha Omar exposes the ugly truth of her... OpIndia Staff - 16 December, 2023 News Reports ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain OpIndia Staff - 17 December, 2023 News Reports ‘I kept sending him money, he kept claiming payment failures’: How a Bengaluru techie lost Rs 68 lakhs trying to sell a used bed... OpIndia Staff - 15 December, 2023 News Reports Congress announces crowdfunding campaign after cash haul of Rs 351 crores seized from Congress MP Dhiraj Sahu in I-T raids OpIndia Staff - 16 December, 2023 News Reports Bengaluru: Christian event ‘Pray for India’ by a foreign pastor cancelled over possible visa rule violations OpIndia Staff - 15 December, 2023 - Advertisement - Latest News I’m sorry for making reels at railway platforms: Instagram content creator apologises after viral dance at Andheri station draws police attention OpIndia Staff - Arvind Kejriwal says AAP wants to contest all 13 seats in Punjab, leaving 0 for I.N.D.I. Alliance partner Congress OpIndia Staff - Party wanted to deny him ticket, those who helped him are dead or in BJP: Rajdeep Sardesai tries to defend Congress over scam accused... OpIndia Staff - Karnataka: BJP MP Pratap Simha slams Congress MLA’s proposal to rename Mysuru Airport after Tipu Sultan, says the name “Nalvadi Krishnaraja Wodeyar Airport” was... OpIndia Staff - Parliament Security Breach: Lalit Jha shared the video of the intrusion with a friend from Bengal urging him to circulate it OpIndia Staff - Porn scandal rocks US Capitol: Democrat Senator Ben Cardin’s legal aide fired after filming gay sex tape in Senate Hearing room OpIndia Staff - King of Bhutan thanks PM Modi and India for support in rail network during his National Day address OpIndia Staff - PM Narendra Modi to inaugurate 2nd Kashi Tamil Sangamam in Varanasi, to launch and inaugurate various projects along with a Vande Bharat train OpIndia Staff - ‘I am a servant of Mahakal’: Madhya Pradesh CM Mohan Yadav on breaking 211-year-old myth of Ujjain OpIndia Staff - Fact Check: Did a Hindu man masturbate in front of women in UK? No, the perpetrator is Sheraz Riaz OpIndia Staff - Read all the latest news Connect with us 255,564 Fans Like 665,518 Followers Follow 38,000 Subscribers Subscribe Subscribe to our Newsletter Each morning, get an email to keep updated with all the news, opinions and analysis published by OpIndia. Enter your email address: Browse by months Browse by months Select Month December 2023 November 2023 October 2023 September 2023 August 2023 July 2023 June 2023 May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2022 August 2022 July 2022 June 2022 May 2022 April 2022 March 2022 February 2022 January 2022 December 2021 November 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 January 2021 December 2020 November 2020 October 2020 September 2020 August 2020 July 2020 June 2020 May 2020 April 2020 March 2020 February 2020 January 2020 December 2019 November 2019 October 2019 September 2019 August 2019 July 2019 June 2019 May 2019 April 2019 March 2019 February 2019 January 2019 December 2018 November 2018 October 2018 September 2018 August 2018 July 2018 June 2018 May 2018 April 2018 March 2018 February 2018 January 2018 December 2017 November 2017 October 2017 September 2017 August 2017 July 2017 June 2017 May 2017 April 2017 March 2017 February 2017 January 2017 December 2016 November 2016 October 2016 September 2016 August 2016 July 2016 June 2016 May 2016 April 2016 March 2016 February 2016 January 2016 December 2015 November 2015 October 2015 September 2015 August 2015 July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 Contact: [email protected] About us News and opinion website that brings you reports and narrative from a perspective often ignored or suppressed by the mainstream media of India. Follow us Facebook Instagram RSS Twitter Youtube © OpIndia.com Latest News Hindi News MyVoice Terms Privacy Policy About Us Contact Us", "pubDate": "2023-12-17 14:05:18", "image_url": "https://i0.wp.com/www.opindia.com/wp-content/uploads/2023/12/Untitled-design-2023-12-17T180847.008.jpg?fit=696%2C398&ssl=1", "source_id": "opindia", "source_priority": 37271, "country": ["india"], "category": ["politics"], "language": "english"}, {"article_id": "6a782425d3d831a35a33d9c1957a0bd4", "title": "Fox News Poll: Majorities support measures to strengthen border security as the issue increases in importance", "link": "https://www.foxnews.com/official-polls/fox-news-poll-majorities-support-measures-strengthen-border-security-issue-increases-importance", "keywords": ["b95422d5-40d4-5fc1-ab3a-fb90ca56a100", "fnc", "Fox News", "fox-news/columns/fox-news-poll", "fox-news/politics/elections", "fox-news/politics/elections/presidential", "fox-news/us/immigration/border-security", "fox-news/topic/border-wall", "fox-news/us/immigration", "fox-news/us/immigration/illegal-immigrants", "fox-news/official-polls", "article"], "creator": null, "video_url": null, "description": "While the economy still dominates voters' minds, the number of registered voters who feel that border security should be a top priority has spiked.", "content": "close Video We need to go back to Trump border policies: Rep. Virginia Foxx Rep. Virginia Foxx, R-N.C., discusses the negotiations on Capitol Hill over border funding and the House's probe into antisemitism on college campuses. While the economy is still the most important issue facing the country, the number of registered voters who feel that immigration/border security should be the top priority has increased by 8 percentage points since August, landing it firmly in second place. That surge comes as most think the immigration situation in the south is an emergency or a major problem and majorities support policies to strengthen the border. The latest Fox News Poll, released Sunday, finds 8 in 10 voters think the situation at the southern border is either an emergency (34%) or a major problem (45%). That’s similar to views in October overall, except voters then were more likely to classify it as an emergency (48%) rather than a major problem (37%). Fox News Poll (Fox News) When it comes to shoring up the perimeter, the most favored tactic is increasing the number of border agents (79% favor). About two-thirds support deporting those here illegally (67% favor), penalizing businesses that knowingly hire illegal immigrants (64%), and allowing illegal immigrants who have U.S. jobs to stay and apply for legal status (62%). Fewer, although still majorities, favor using the U.S. military at the border (58%) and building a wall (54%). SENATE UNDER PRESSURE: SCHUMER CANCELS PART OF HOLIDAY RECESS TO ADDRESS LONG LIST OF TASKS There is bipartisan support for hiring more border agents (68% of Democrats favor and 93% of Republicans) and fining businesses for knowingly hiring illegal immigrants (53% and 78%). Fox News Poll (Fox News) But there are stark partisan differences on allowing those working in the U.S. to apply for legal status (80% of Democrats favor it vs. 40% of Republicans), sending troops to the border (36% vs. 82%), and constructing the wall (25% vs. 88%). Republicans overwhelmingly favor deporting illegal immigrants (89%) while Democrats are divided (48% favor, 44% oppose). One notable shift over the past several months: voters are more likely to favor deporting illegal immigrants now (67%) than they were in February (58%). Groups across the board are keener to send them back, including Democrats (+8 points), Republicans (+10), and independents (+11). When it comes to legal immigrants, 55% of voters think they do more to help the country while 37% think they hurt it. Fox News Poll (Fox News) Majorities of Democrats (73%) and independents (55%) feel legal immigrants help, while over half of Republicans say they cause harm (55%). Nineteen percent identify immigration/border security as the most important issue facing the country, up from 11% in August. The increase comes primarily from Republicans (+13 points) and men (+10) putting more importance on the topic than before. The economy is still by far the top priority to voters overall (35%). Republicans’ top issues are the economy (40%) and immigration/border security (35%). The economy is also number one among Democrats (27%), but then importance splinters among others, such as guns (16%), climate change (13%), voting rights (12%), and abortion (10%) – hardly any say immigration (5%). Fox News Poll (Fox News) The Biden administration and Congressional Republicans are locked in a fierce debate over a spending package meant to send billions in aid to wars in Israel and Ukraine. Republicans are pushing to pair that aid with tougher border policies. EX-ICE CHIEF THOMAS HOMAN EYES ‘HISTORIC’ DEPORTATION IF TRUMP'S RE-ELECTED: ‘NO ONE’S OFF THE TABLE' One third of voters approve of how President Biden’s handling border security (33%) while 63% disapprove. His approval on the border reached a high of 40% in May 2021 and hit a low of 30% last month, but it’s mostly stayed between 33-37%. CLICK HERE TO GET THE FOX NEWS APP \"Immigration is fast becoming the paradigmatic example of government's incompetence,\" says Republican pollster Daron Shaw who conducts the Fox News survey with Democrat Chris Anderson. \"There is no coherent policy to secure the border, and neither is there any immediate prospect for dealing with millions of undocumented workers in the U.S. The images from the southern border are both heartbreaking and appalling.\" CLICK HERE FOR TOPLINE AND CROSSTABS Conducted Dec. 10-13, 2023, under the joint direction of Beacon Research (D) and Shaw & Company Research (R), this Fox News Poll included interviews with 1,007 registered voters nationwide who were randomly selected from a voter file and spoke with live interviewers on both landlines and cellphones. The total sample has a margin of sampling error of plus or minus three percentage points.", "pubDate": "2023-12-17 14:01:43", "image_url": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/09/931/523/abbottborder.jpg?ve=1&tl=1", "source_id": "foxnews", "source_priority": 59, "country": ["united states of america"], "category": ["top"], "language": "english"}], "nextPage": "1702821703347232912"}