{"status": "success", "totalResults": 113, "results": [{"article_id": "659990458596c80558331878631a5953", "title": "Editorial cartoons for Dec. 17, 2023: Ukraine aid fight, campus speech debate, Biden impeachment", "link": "https://www.oregonlive.com/opinion/2023/12/editorial-cartoons-for-dec-17-2023-ukraine-aid-fight-campus-speech-debate-biden-impeachment.html", "keywords": null, "creator": ["Marie Morelli"], "video_url": null, "description": "The week in visual commentary.", "content": "Ukrainian President Volodymyr Zelenskyy came hat in hand to Washington, D.C., last week to ask for more U.S. military aid in his country’s fight against Russian invaders. Congressional Republicans tied more Ukraine aid to increased border security measures, leading to a stalemate. In the gallery’s lead image, Bill Bramhall sees the GOP’s refusal to aid Ukraine as raising the flag of surrender to Russia, borrowing imagery of Marines raising the U.S. flag over Iwo Jima. Drew Sheneman critizes Republicans for being Russian leader Vladimir Putin’s “useful idiots.” Phil Hands draws Putin cheering Santa putting coal in Ukraine’s stocking. Scott Stantis blames both Republicans and Democrats for failing to fix the broken immigration system. The uproar continued over the congressional testimony of university presidents about antisemitic speech on college campuses, sparked by protests of the war in Gaza. University of Pennsylvania President Liz Magill resigned. Harvard’s governing board decided to keep President Claudine Gay in her role. “My responses got a bit tangled,” Walt Handelsman’s president says from behind a thicket of ivy. Poison ivy covers Harvard University, in Michael Ramirez’s view. David Horsey illustrates the hypocrisy of college leaders sensitive to cultural appropriation but who see antisemitism as free speech. Other topics in this week’s cartoon gallery include the House’s party line vote to open an impeachment inquiry into President Joe Biden, in a quest for evidence to support such a charge; a Texas woman’s losing fight to get an abortion under the state’s medical exception; and the toll of war in Gaza. Cartoons were drawn by Jack Ohman, Bill Bramhall, Dana Summers, Drew Sheneman, Scott Stantis, Walt Handelsman, David Horsey, Phil Hands, Joel Pett and Joey Weatherford of Tribune Content Agency; and Mike Luckovich, Steve Breen and Michael Ramirez of Creators Syndicate.", "pubDate": "2023-12-17 13:00:00", "image_url": "https://www.oregonlive.com/resizer/8ksnbSBIjfoYEogQE9KilMaYMjM=/0x1200/cloudfront-us-east-1.images.arcpublishing.com/advancelocal/OEXEK3JQO5DBFA3AUF4ZGMXU5E.jpg", "source_id": "oregonlive", "source_priority": 2111, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "c1cf22ee532b34bf4979027eb47e2a05", "title": "The campus war over words on Israel and Palestine", "link": "https://thehill.com/opinion/education/4364136-the-campus-war-over-words-on-israel-and-palestine/", "keywords": ["Education", "Opinion"], "creator": ["Glenn C. Altschuler &amp; David Wippman, opinion contributors"], "video_url": null, "description": "Colleges and university administrators have — rightly, in our view — rejected academic boycotts as threats to the free exchange of ideas.", "content": "The Hamas terrorist attacks of October 7 have highlighted sharp disagreements — among college and university leaders, students, faculty, alumni, politicians and the general public — over where to draw the line between protected speech and impermissible harassment or threats. Anger at the language and tactics of pro-Palestinian protesters and insistence on stronger action from colleges and universities to suppress antisemitism are resulting in demands for policies that, in some cases, conflict with the values of academic freedom and free speech. Much of the rhetoric that divides college campuses, including claims that Israel is a “settler-colonialist” “apartheid” state guilty of genocide against the Palestinians, has its roots in the boycott, divestment and sanctions (BDS) movement. Proponents describe BDS as a campaign of to withdraw from the occupied territories, respect the rights of its Palestinian citizens and allow Palestinian refugees the right to return to their homes. Critics condemn it as an antisemitic attempt to and an assault on “Jews who support Israel’s right to exist.” Many experts to the controversial 2001 NGO Forum at the World Conference on Racism in Durban, South Africa, which equated Zionism with racism and guilty of “war crimes, acts of genocide and ethnic cleansing.” The economic impact of BDS boycotts has been , but it has attracted a following in academia, a “ .” A significant number of , including the American Studies Association, the American Anthropological Association, and the National Women’s Studies Association, have supported boycotts of Israeli academic institutions. And periodically push divestment resolutions, participate in an annual “Israel Apartheid Week,” and stage “die-ins” to protest Israel’s treatment of Palestinians. Colleges and university administrators have — rightly, in our view — as threats to the free exchange of ideas. In 2017, the denounced BDS as “ .” In 2019, the House of Representatives for promoting “principles of collective guilt, mass punishment and group isolation.” Both the and the administrations have condemned BDS, and requiring government contractors to affirm they do not boycott Israel or barring companies supporting BDS from receiving government contracts. Courts have found infringements on free speech. A loosely organized movement whose supporters do not always agree on means and ends, BDS has “a proxy for the Israel-Palestinian conflict … with all the emotion the conflict stirs,” according to the New York Times in 2019. BDS backers note that boycotts have often been used to pursue civil rights goals and insist that BDS is a legitimate attempt to protect the rights of Palestinians. Critics respond that BDS is an inherently antisemitic effort to eliminate Israel as a Jewish state. Until last year, however, of BDS. That changed with the outbreak of war between Israel and Hamas, as their tactics and their rhetoric. At Brown University, 41 students who demanded that the school divest “from Israeli military occupation” were after refusing to leave an administration building after hours. At Cornell University, a group of protesters, after finding the university’s president in a mock trial, occupied the university’s main administration building. At the University of Minnesota, the tenured faculty in the Gender and Women’s Studies Department a lengthy statement on the department’s website accusing Israel of a “genocidal war” against the Palestinians and endorsing “the call by Palestinian civil society for BDS.” And at Amherst College, on the school to divest from companies that “directly profit … from the ongoing Israeli military operations that are laying Gazan life and society to waste.” As anger at BDS-style rhetoric grows, demands to suppress antisemitism are growing with it. Government officials have threatened to defund colleges tolerating “ ,” the Department of Education has opened investigations into antisemitism at , and donors and alumni have demanded college policies prohibiting “ ” as well as threats and violence. Brandeis University has pledged to to student organizations supporting the BDS movement because it “aims to dismantle the Jewish state.” In effect boycotting the boycotters, the University of Arkansas at Fayetteville now to sign a pledge declaring they do not support BDS. The long-running controversy over BDS serves as a reminder, especially in the present heated environment, of the daunting challenge facing colleges and universities, which must fulfill two imperatives that are sometimes at odds. Hate speech (even when it is protected speech) attacks the dignity and worth of those subjected to it, undermines their sense of physical and emotional safety and is therefore “inimical to learning.” Many Jewish, Muslim and Arab students now feel unsafe on college campuses, and their learning is at risk. At the same time, the of academic freedom and free speech are “the very precondition of the academic enterprise itself.” (These quotes come from the American Association of University Professors’ 1994 statement “On Freedom of Expression and Campus Speech Codes.”) Those principles require tolerating even deeply offensive speech, of true threats, incitement to imminent unlawful action or harassment. Managing this tension has been rendered more problematic because many colleges and universities have not applied free-expression policies consistently, leading to of hypocrisy and left-wing bias. Finding ways to foster a safe and inclusive learning environment without sacrificing their commitment to free and open inquiry may be the single most important — and most difficult — task facing higher education leaders today.", "pubDate": "2023-12-17 12:00:00", "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/12/GettyImages-1745431836.jpg?w=900", "source_id": "thehill", "source_priority": 393, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "4cafe4b3671e38e7f00f831ca3839010", "title": "Captain America 4 Release Date: Why It’s Delayed and What to Expect From the New World Order?", "link": "https://investrecords.com/captain-america-4-release-date/", "keywords": ["Entertainment"], "creator": ["Joe King"], "video_url": null, "description": "Captain America 4 release date: After the major happenings of Avengers: Endgame, Captain America seemed to be the only person who could lead the MCU. But since then, a new man has taken up the shield. We can’t wait to see what he does with it. The new Captain America joined the MCU during the […]", "content": "After the major happenings of Avengers: Endgame, Captain America seemed to be the only person who could lead the MCU. But since then, a new man has taken up the shield. We can’t wait to see what he does with it. The new Captain America joined the MCU during the Marvel series The Falcon and The Winter Soldier. That’s between WandaVision and Loki if you’re seeing all of the Marvel movies and TV shows in order. The second star-spangled man is Sam Wilson, played by Anthony Mackie. He could be a very different Captain than Steve Rogers. So, what can Sam look forward to in his next Marvel movie? This is what we know. Table of Contents Captain America 4 Release Date After the end of the 2023 Hollywood strikes, Marvel Studios changed its whole release schedule and plans, which caused Brave New World to be pushed back by almost a year. This is now the last movie in Marvel’s Phase 5. Who is in the Cast of Captain America 4? James Badge Dale, Harrison Ford, Liv Tyler, and Tim Blake Nelson are just a few of the actors who will be in Captain America 4. Daniel Ramirez will play Joaquin Torres again, also known as the “new Falcon.” Harrison Ford will play Thaddeus Ross in this movie, which is also very exciting news. We should also say that he will play President Thaddeus Ross, who is one of the best MCU characters ever. That’s correct. Ford is once again in charge of the White House. Here is the cast list for Captain America 4: It was directed by Julius Onah, who also made The Cloverfield Paradox. The story was written by Dalan Musson and Malcolm Spellman, who also worked on The Falcon and The Winter Soldier. What is the Story of Captain America 4? The name of the movie makes it sound like it will be based on a Marvel comic book story called “New World Order.” The Red Skull tried to take over the world, which is what Marvel bad guys do in this story that spanned several books. Could the Red Skull come back, or will The Leader take his place? The Soul Stone was holding The Red Skull prisoner. That’s gone now, though, so who knows? Did the Title of Captain America 4 Change? No real reason has been given for why Marvel changed the name. A lot of fans think it was to escape trouble, though. New World Order is not only the name of a group of bad guys in comic books; it’s also the name of an antisemitic conspiracy theory. For good reason, Marvel probably wanted to stay away from any connections. As was already said, though, none of this has been proven and is just fan theory. Speculation about the Captain America 4 Trailer Conclusion Captain America 4 is set to release on February 14, 2025, following the release of Deadpool 3. The film stars Anthony Mackie as Sam Wilson, who may be a different Captain than Steve Rogers. The story is based on a Marvel comic book story called “New World Order,” where the Red Skull tried to take over the world. The title has been changed to “Brave New World” to avoid controversy. There is no official trailer for Captain America 4, and footage is expected to arrive in early 2024.", "pubDate": "2023-12-17 11:30:43", "image_url": "https://investrecords.com/wp-content/uploads/2023/12/3-3.jpg", "source_id": "investrecords", "source_priority": 31663, "country": ["united states of america"], "category": ["entertainment"], "language": "english"}, {"article_id": "e4bf45fb996074c2ff57807b368a254b", "title": "Germany pledged 'never again.' Here's how it's grappling with Israel's bombing of Gaza", "link": "https://www.latimes.com/opinion/story/2023-12-17/germany-israel-gaza-antisemitism-holocaust-genocide-palestinians-solidarity", "keywords": null, "creator": null, "video_url": null, "description": "After the Holocaust, Germany committed to standing against mass violence. Why are authorities now arresting Jews protesting Israel's bombardment in Gaza and canceling events with Palestinians?", "content": "The principle of “never again” is built into the very foundations of German national identity. The reasons should be obvious. German disavowal of its past through commemoration has become something of a gold standard for countries that have perpetrated unforgivable crimes. And yet, since Oct. 7, Holocaust memory has increasingly been invoked in Germany to suppress debate on Hamas militants’ massacres of that day in Israel and the brutalities the Israel Defense Forces have meted out against Gaza Strip civilians in the aftermath. It appears that something has gone terribly awry in Germany’s famed “culture of memory.” In Germany, it has become virtually impossible to stand against the IDF’s violent targeting of Gazan civilians without being smeared with suspicions of antisemitism. The German-based Heinrich Böll Foundation reportedly withdrew its support from co-sponsoring the Hannah Arendt Prize for political thought to journalist Masha Gessen because of an essay they wrote this month in the New Yorker, in which they drew parallels between Gaza and a Jewish ghetto . While this started before Oct. 7, what has been remarkable in the present crackdown is the inordinate number of Jews and Israelis in Germany now under attack for speaking out against the killing of civilians in Gaza. Even more disturbing is how many of them are being framed as antisemitic by German authorities, who similarly censure Arab and Middle Eastern communities who critique Israel. At stake here is not only the German process of reckoning with its own past, but also the very fate of “never again” as an orientation around which we can make common cause against ongoing atrocity. Germany’s memory culture rests on a basic conviction: that our ancestors are supposed to keep us honest in both their virtues and their sins, in how they lived, died, killed, were killed, took and were taken from. It is based on a conviction that public memory includes reckoning with both the unrepented crimes and the unredeemed injuries of our ancestors, and asks us to place these concerns at the center of our ethical imagination as we address not just the past, but also the present. German law thus forbids denial of the Holocaust . The country also criminalizes expressing racist and antisemitic hate speech as well as denying war crimes and genocide . Many in the international community have come to admire Germany’s willingness to look inward for the enduring legacies of national crimes. And they would even like to see “never again” expanded into an ethic that could be applied anywhere, rather than limited to a national or ethnic scope. In Germany, however, the promise of “never again” has contracted. Too often, German authorities now surveil newly arrived immigrants — out of fear that they might “import” antisemitism into the country — as well as the growing number of Jews who insist on their right not to see atrocities committed in their name. In Germany, Jews and Arabs are again placed under a special scrutiny. Over the last two years, for instance, demonstrations commemorating the anniversary of the Nakba, when Palestinians were displaced and Israel was created in 1948, have largely been outlawed . Of those who defied this ban, many were members of Juedische Stimme, or “Jewish Voice,” a group of Jewish activists expressing solidarity with Palestinians. In last year’s Nakba demonstration, the majority of those arrested were Jewish members of the group. Since then, things have only escalated. A leading member of Juedische Stimme who was born and raised in Israel was recently detained for a solitary protest in which she held a sign in a Berlin public square that read: “As a Jew and Israeli: Stop the genocide in Gaza.” We can question the value of the term the protester used on her sign to describe what’s happening in Gaza, but it’s a debate we need to have. Meanwhile, an award ceremony at the Frankfurt Book Fair honoring Palestinian novelist Adania Shibli was canceled by organizers in October. Her novel “Minor Detail” explores a historical murder of a Bedouin Palestinian girl by Israeli soldiers, a topic considered too incendiary . A few weeks later, the Federal Agency for Civic Education canceled a symposium titled “We Still Need to Talk,” which had been planned for early December. The event was intended to start a conversation about how the paradigm of Holocaust memory could create a space for reflection and solidarity embracing commonalities and differences between the Shoah and other events of historical trauma (colonial genocides, the legacy of American slavery, for instance). In a statement , the organizers, who included Michael Rothberg, chair in Holocaust studies at UCLA, and Candice Breitz, a Berlin-based artist whose work grapples with global geographies of race, opposed the decision to call off the event. Consider what we are seeing in these events. German police are arresting Jews for political expression criticizing the state of Israel, all in the name of combating antisemitism, while the German descendants of perpetrators (virtually all of us are) are declaring a proprietary expertise, accusing Jews and Arabs alike of not understanding the political purchase of antisemitism in our present. Out of a laudable conviction that we, as German descendants of perpetrators (sometimes victims), have a special responsibility when we see violence meted out against the defenseless has emerged a proprietary relationship to the aspiration of “never again.” From subjecting the legacies of their own perpetration to scrutiny, German political institutions are increasingly directing scrutiny at others, framing antisemitism as a problem to be called out in others. If the optics here do not inspire a deep sense of unease, perhaps it is we who have not grasped the basic lessons of German history. I have spent much of my scholarly career working in countries where the naming of ethnic cleansing, apartheid and genocide are fiercely debated as political violence rolls on unchecked. I am no stranger to the fact that, as the often-abused turn of phrase goes, “it’s complicated.” But the current situation in Germany makes a few things painfully clear. Public memory — the way pasts are kept as common parts of our shared social fabric — is a critical resource without which the very idea of a shared humanity is inconceivable. Public memory, as such, can never be owned. The profound intergenerational grief that comes in the wake of historical traumas is a painful legacy, but a conversation about the contemporary meaning of that legacy cannot be avoided if “never again” is to remain a political ethic responsive to our present. We need to keep having this conversation, lest we resign ourselves to a world in which “never again” will always only mean “never again, next time.” Manuel Schwab is a professor of anthropology at the American University in Cairo who lives and works part time in Berlin.", "pubDate": "2023-12-17 11:15:12", "image_url": null, "source_id": "latimes", "source_priority": 267, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "9a5e14fbdfbf7cedad8d88823bde4fbe", "title": "University Presidents Under Fire", "link": "https://www.newyorker.com/magazine/2023/12/25/university-presidents-under-fire", "keywords": ["Magazine / Comment"], "creator": ["Jeannie Suk Gersen"], "video_url": null, "description": "No one should be duped into applauding a McCarthyesque spectacle of members of Congress demanding firings by universities.", "content": "On a wet afternoon in late September, Claudine Gay, the first Black president of Harvard University, delivered her inaugural address. Gay, who had previously been the dean of Harvard’s Faculty of Arts and Sciences, said that knowledge is best served “when we commit to open inquiry and freedom of expression as foundational values of our academic community,” adding that a diversity “of backgrounds, lived experiences, and perspectives” enables “the learning that happens when ideas and opinions collide.” The past several years, of course, have seen an erosion of academic freedom. From book bans to the notion that offensive ideas make one unsafe, both the right and the left have participated in curtailing open inquiry. As dean, Gay built a reputation for prizing the principles of diversity, equity, and inclusion, which are often perceived as intolerant of viewpoints—say, that marriage is limited to a man and a woman, or affirmative action is discriminatory, or there are only two biological sexes—that may offend marginalized groups. At her inauguration, she warned that diverse viewpoints “can be a recipe for discomfort, fired in the heat of social media and partisan rancor,” and that this can “make us vulnerable to a rhetoric of control and containment that has no place in the academy.” A week later came the attack of October 7th. The shocking severity of Hamas’s slaughter, rape, and kidnapping of Israelis had not yet sunk in, but that same day thirty-four Harvard student organizations issued a statement holding “the Israeli regime entirely responsible for all unfolding violence,” because of its previous actions in Gaza. The backlash was swift. Some called for disciplinary measures. The hedge-fund C.E.O. Bill Ackman, a Harvard alumnus, demanded that the names of the organizations’ members be released, so that potential employers could avoid hiring them. A truck in Harvard Square displayed students’ faces with the caption “Harvard’s leading antisemites.” Denunciations came from lawmakers, including the Republican congresswoman Elise Stefanik, of New York, an ardent Trump supporter and a Harvard alumna. On October 9th, Gay and the university’s deans issued a statement emphasizing “our common humanity” and “goodwill in a time of unimaginable loss and sorrow,” but did not explicitly condemn Hamas or rebuke the student groups. Gay’s successive pronouncements condemning the terror attack and denouncing antisemitism and introducing an advisory group to address it created an unfortunate appearance of her being pushed to say whatever might quell the public-relations storm. When she defended free speech in response to calls to curb anti-Israel or antisemitic statements, critics cried hypocrisy, noting that Harvard intervenes in incidents of alleged racist and sexist speech, under the rubric of harassment and discrimination policies—though not to the punitive degree the critics were demanding. If Gay hoped to implement the free-expression vision of her inaugural address, the furor was derailing it. Many academic-freedom proponents yearned for the University of Chicago’s Kalven principles, which require university leaders not to issue statements on social and political matters, so that the university can be a neutral forum for diverse viewpoints, political protest, and candid discussion. But in November, amid pressure to punish protesters chanting “From the river to the sea, Palestine will be free,” Gay declared, “I condemn this phrase.” To some, including Hamas, the slogan advocates eliminating Israel or the Jewish presence in the Middle East, but to others it advocates freedom and equality for Palestinians. During the December 5th congressional hearing on campus antisemitism, Representative Stefanik insisted that such slogans are genocidal. As she and other Republican lawmakers grilled three university presidents—Gay; Liz Magill, of the University of Pennsylvania; and Sally Kornbluth, of M.I.T.—she asked, “Does calling for the genocide of Jews violate Harvard’s rules on bullying and harassment?” Gay said that it can, “depending on the context.” Kornbluth and Magill offered similar responses. Stefanik declared them “unacceptable.” The claim that the answer depends on context is correct; any responsible determination of a policy violation is context-dependent. In the context of October 7th, it would have been clearer to say something like “Yes, calling for a person to be killed because they are Jewish or Palestinian would constitute bullying and harassment. And, if the phrase ‘from the river to sea’ was used specifically to threaten to kill someone, that would at a minimum violate the rules.” It is unlikely, however, that any correct answer would have been acceptable. The presidents walked into an ambush, having prepared for a deposition (where counsel advises minimalist answers) rather than for political grandstanding. And the moment plainly needed a moral statement rather than a legally precise reply. More than seventy congresspeople demanded that all three presidents be fired. Magill was already vulnerable—donors had rescinded funds in response to Penn’s hosting a Palestinian literary festival, in September, to which a speaker who had been accused of antisemitism (and denied it) was invited—and she resigned. Stefanik responded, “One down. Two to go.” The fact that the presidents are women and that Gay is Black made them a target for attacking diversity and equating it with being unqualified. Ackman commented that “shrinking the pool of candidates based on required race, gender, and/or sexual orientation criteria is not the right approach to identifying the best leaders for our most prestigious universities.” But, after seven hundred faculty members (I was among them) urged Harvard’s governing board “to resist political pressures that are at odds with Harvard’s commitment to academic freedom,” the board unanimously supported Gay’s continuing as president, writing, “We champion open discourse and academic freedom.” No one should be duped into applauding a McCarthyesque spectacle of members of Congress demanding firings by universities. Last year, Stefanik co-sponsored the Restoring Academic Freedom on Campus Act, claiming that some universities, in their devotion to “Far Left woke ideology,” had failed in the task of “encouraging diversity of ideas.” Some conservatives appear to think that the wave of moral panic they are riding will somehow bring about more freedom of expression. But inciting rage over not punishing antisemitic speech, or speech that they take to be antisemitic, will place pressure on universities to create or toughen codes to restrict even more speech. Here’s hoping that universities will have the courage to level up on academic freedom rather than down. ♦", "pubDate": "2023-12-17 11:00:00", "image_url": "https://media.newyorker.com/photos/657b5ea63a0475157a913215/master/pass/Comment-Gersen-12-15-23.jpg", "source_id": "newyorker", "source_priority": 776, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "f498b1573fbdb099f2d1e5f5e993e4aa", "title": "Harvard seeks to move past antisemitism controversy", "link": "https://thehill.com/homenews/education/4362225-harvard-antisemitism-controversy-gay-penn-mit/", "keywords": ["Education", "antisemitism", "Claudine Gay", "Harvard"], "creator": ["Lexi Lonas"], "video_url": null, "description": "Harvard University has a difficult job ahead as it works to rebuild trust in its community and try to move on from the fallout of its president’s testimony before Congress. Unlike the head of the University of Pennsylvania (UPenn), Harvard chief Claudine Gay was able to keep her position after international backlash when two the...", "content": "Harvard University has a difficult job ahead as it works to rebuild trust in its community and try to move on from the fallout of its president’s testimony before Congress. Unlike the head of the University of Pennsylvania (UPenn), Harvard chief Claudine Gay was able to keep her position after international backlash when two the leaders, as well as the president of the Massachusetts Institute of Technology (MIT), refused to say that a call for Jewish genocide would constitute harassment. Those invested in the campus culture say Harvard needs to begin an open process of remedying its policies to earn their trust back. Roni Brunn, a leading member of the Harvard Jewish Alumni Association, said the university needs to be “transparent” in its next steps. She lamented the vague statements and promises from Harvard that students who have crossed the line into antisemitism are facing repercussions. “The other thing about it is that Harvard, they’re saying that they did take some disciplinary action to students, but it’s held in private,” Brunn said. “There’s nothing announced, so people are not deterred by whatever administrative disciplinary action is taken. So we would like it to be clear that if you do this, this is what’s going to happen, because it’s very vague right now.” Chairwoman of the House Education and the Workforce Committee Virginia Foxx (R-N.C.) announced quickly after the hearing that her panel would be investigating the learning environments and disciplinary policies of Harvard, MIT and UPenn, potentially among other schools. Foxx said the schools could face subpoenas and further calls for testimony as part of the probe. The Department of Education has also opened inquiries into Harvard and UPenn over allegations of antisemitism and Islamophobia. Brunn also pointed to the committee on antisemitism that Gay assembled weeks ago, saying no one knows what’s going on in their meetings and the only insight they have had is when Rabbi David Wolpe quit. In his parting statement, Wolpe said that “the ideology that grips far too many of [Harvard’s] students and faculty, the ideology that works only along axes of oppression and places Jews as oppressors and therefore intrinsically evil, is itself evil.” Unlike Gay, UPenn’s Liz Magill was unable to survive the controversy and was ousted by her school’s board, even after she released a statement walking back her testimony to Congress. “In that moment, I was focused on our university’s longstanding policies aligned with the U.S. Constitution, which say that speech alone is not punishable,” Magill said. “I was not focused on, but I should have been, the irrefutable fact that a call for genocide of Jewish people is a call for some of the most terrible violence human beings can perpetrate. It’s evil — plain and simple.” MIT’s president, meanwhile, quickly received the support of her school’s board despite so far releasing no statement going back or apologizing for her congressional testimony. Gay told The Harvard Crimson, the school’s student newspaper, that she was “sorry” for her House testimony. “I got caught up in what had become at that point, an extended, combative exchange about policies and procedures,” she said. “What I should have had the presence of mind to do in that moment was return to my guiding truth, which is that calls for violence against our Jewish community — threats to our Jewish students — have no place at Harvard, and will never go unchallenged.” Harvard’s next moves are important as one of the most prestigious colleges in the country, with other schools looking to it for guidance, said Jacqueline Pfeffer Merril, director of the Campus Free Expression Project for the Bipartisan Policy Center The defensive position the presidents were in during the hearing “erodes the confidence and trust of the public in our entire system of higher education,” Merril said. “And so I think as an entire sector one of the questions is how is it that we rebuild trust in higher education as institutions of learning, of expertise, of genuinely open debate?” she added. The first step in that process, Merril said, is revisiting free speech and expression policies on campus to provide “robust protection for free speech” and apply the standards in a neutral matter. The Foundation for Individual Rights and Expression (FIRE), a free speech organization, conducts surveys on the culture of free expression on college campuses, and Harvard ranked last on the list, though the university disputes the methods of the organization. “Second, as part of the educational mission, there should be a concerted effort to prepare students to tolerate views with which they deeply disagree and to engage in civil and productive discourse,” Merril said. Free speech advocates have come to the defense of the university presidents after their testimonies, saying the leaders were correct that the First Amendment allows those types of comments on campus depending on the context. “The bottom line is that harassment is a pattern of targeted behavior. For example, it’s hard to see how the single utterance Rep. Elise Stefanik asked about during the hearing — no matter how offensive — would qualify given this pervasiveness requirement,” FIRE said. “And as frustrating as it is to hear the college presidents’ appeals to ‘context’ in yesterday’s hearing, particularly when it doesn’t seem to matter to them when other speech is at issue, the truth is that context does matter,” FIRE added. Harvard has been in the spotlight since the start of the Israel-Hamas war when 30 student-led groups released a statement saying it was Israel’s fault Hamas attacked on Oct. 7 and killed more than 1,500 civilians. Since then, protests with calls to “Free Palestine from the River to the Sea” and other divisive slogans have been held on the Cambridge, Mass., campus. “Considering this conflict is going to go on for several more months, and I assume there will be other additional protests at Harvard, we are going to be keeping Harvard under a microscope,” said Ron Halber, executive director of the Jewish Community Relations Council of Greater Washington. This time around, Halber said he thinks Gay was “genuinely remorseful” for her words and had a “moment to learn.” But if “she fails to meet the test again, she needs to go,” Halber said. “There is no doubt in my mind,” Halber added. “It’s not just, by the way, against the Jewish community but against any community.”", "pubDate": "2023-12-17 11:00:00", "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/12/gayclaudine_120523mn01_w.jpg?w=900", "source_id": "thehill", "source_priority": 393, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "38a130221b3010b9073bed8ba444780b", "title": "The Chancellor of Berkeley Weighs In", "link": "https://www.newyorker.com/news/the-new-yorker-interview/the-chancellor-of-berkeley-weighs-in", "keywords": ["News / The New Yorker Interview"], "creator": ["Molly Fischer"], "video_url": null, "description": "Carol Christ reflects on campus protests, then and now.", "content": "When Carol Christ first joined the faculty at the University of California, Berkeley, more than fifty years ago, she remembers a new colleague giving her a half-joking piece of advice: don’t bother preparing the last three weeks of your class, because you’ll never get to teach them—the students will all be out on strike. Protest has been part of her experience at Berkeley throughout her career there, first as an English professor (she specializes in Victorian literature) and later as an administrator; apart from an eleven-year stint as the president of Smith College, in the early two-thousands, the university has been her professional home. She assumed its top leadership role—chancellor—in 2017, and announced last summer that she would retire in 2024. The job of heading a college or university has rarely come under greater public scrutiny than in the past two months. Since the October 7th Hamas attacks on Israel and the beginning of the Israeli assault on Gaza, campuses across the country have seen a wave of protests—and accompanying accusations of both Islamophobia and antisemitism. There have been demonstrations, open letters, official statements, follow-up official statements, confrontations, threats, anger, and fear. At Cornell, campus police placed the Center for Jewish Living under guard; at Columbia, the administration pro-Palestinian student groups. At Berkeley, students organized a mass on behalf of Palestine. During the walkout, a student carrying an Israeli flag was allegedly hit with a water bottle, an incident that’s now among the campus conditions cited in a alleging antisemitism at the law school. Earlier this month, the presidents of Harvard, M.I.T, and the University of Pennsylvania testified before Congress in a hearing titled “Holding Campus Leaders Accountable and Confronting Antisemitism.” Congresswoman Elise Stefanik, a Trump-aligned Republican, went viral with her questioning, in which she pushed the presidents to say whether “calling for the genocide of Jews” violated their institutions’ rules. Their responses, which parsed definitions of protected speech, inspired widespread outrage. Liz Magill resigned as president of Penn a few days later. Claudine Gay faced calls to step down as president of Harvard, but maintained the governing board’s support. Christ spoke to me over Zoom from her office. After a turbulent semester, the campus seemed quiet, she said—it was finals week, and students were focussed on their work. The question on the horizon: “What do we do when the spring semester starts?” She’d been thinking about the Vietnam War, and the teach-ins she attended in her own student days. “You went to learn; they weren’t shouting matches,” she told me. “I wonder if we can use something like that.” In our interview, which has been edited for length and clarity, she discussed her hope that through free speech, the Berkeley community can find a way to navigate “almost existential differences of opinion.” What I think a president or chancellor needs to do is make space for all students. In other words, in these days of increasing diversity of all sorts on college campuses, what the president or chancellor, I believe, needs to do is to create a sense of belonging, of membership in the campus community, for all students. And that means, in relation to a very divisive issue like the current conflict, you of course want to express sympathy, compassion, and empathy for the extraordinary suffering that has gone on in the Middle East; the loss of life; the way in which students are deeply, deeply affected, feel unsafe, feel harassed, and are just deeply caught up in this conflict. At the same time, I think it’s wrong for someone in this position—although this is controversial, and many people, particularly outside universities, don’t have sympathy with this point of view—to take sides or to pass judgment on one party or the other. One of the really interesting things about universities in general is that they have an enormous range of both individuals and groups who feel that they have an ownership stake. So it’s not as hierarchical a structure as you would think. Whether it’s alumni or donors or students, staff, faculty—all of them feel with passion that they have an ownership stake, and should be able to have a major voice in positions that the institution takes. I have not been in a crisis in which presidents’—or, in my case, chancellors’—words have seemed so important. And not just but, rather, very particular words. You must use this word; you must not use this word. Sometimes I’ve felt like I’m in a situation in which there are at least two, sometimes I think more, speech codes that people are using to represent their sense of the situation. There’s a speech code if you’re representing the situation of Israel, in anger and with a sense of its violation, and there’s a speech code if you’re speaking about the Palestinian history in Gaza and the West Bank, and often the words are the same. But they mean something different and they apply to different things. This situation is so different from other situations of controversy in that it has really split the student body. If you go way back to the Free Speech Movement, for example, that was the students versus the administration—not a lot of controversy among students.The shape of this particular situation is really different because there is a deep, deep division on the campus. I think it’s very different now. There’s hardly an event in the world that happens where I don’t get pressure to make a statement. I think in part it reflects the time rhythms and the digital media of our news world right now. Before there was the Internet, if you made a statement, you would spend a lot of time writing it. It was a long process. I’ve very rarely had not only “Make a statement” but also “Let me read the statement first and revise it before you make it.” From campus groups—they want to read the statement, want to revise the statement, want sometimes to write the statement. It’s a very interesting way of claiming “I am seen”—by writing the words that represent the situation, whatever the situation is. I think it’s a relatively recent development. I don’t remember it ever happening when I was president of Smith, even though that was post-Internet. I’m not sure I can claim there’s one event. Certainly the murder of George Floyd was an event in which I think most presidents spoke up. I didn’t watch the testimony, so all I’ve read are news accounts. It’s striking to me that all three presidents are new presidents, and that all three presidents are women—so there’s a kind of symmetry that I think wasn’t intended in their appearance. I also think one of the things that has happened is that there’s a narrative about higher education, generally, that’s politically useful to some groups in this country, and this very difficult situation with Israel and with Palestine is getting absorbed into that narrative. I also think that there is a tension between Title VI protections and First Amendment protections, and that hasn’t really been tried in court. I think it may be a very interesting product of this moment. One of the ways in which I’ve tried to frame my comments about the current situation is our . I say often, to lots of different audiences, “Just because you have the right to say something doesn’t mean that it’s right to say.” The protections in our society, I think quite rightfully, are extraordinarily broad for free speech. When I talk about them, I often talk about John Stuart Mill and what he says about the marketplace of ideas, and how it’s only by having bad ideas colliding with good ideas that the truth comes out in our age of disinformation. I’m not sure how much Mill’s arguments about free speech really hold up. But, nonetheless, that’s certainly the idea for free speech. And the question about censorship of speech is always “Who’s the censor? Who has the power to determine what can’t be said?” And is that a step down a slippery slope that leads to restrictions that many people would not want on free speech? And is therefore the consequence of people sometimes saying abhorrent things with the legal license to do so—is that the price that we pay for not having that censoring authority? One of the things that’s exciting about universities is you have this community that’s constantly changing. You can’t say, “Oh, I said that already.” Because it’s a new audience that’s there. Universities are places where students are for a time while they get their degree. But that means that you always have new people who may not understand how to act in a community. I myself believe that the pandemic has really reduced, generally, people’s social skills. So you have students coming here, also adults coming here, who have real gaps in their usual social experience because of the pandemic. The very nature of students—it’s why I love them, I love being with them—is that it’s these years between eighteen and your early twenties when you’re forming your identity, and young people of that age sometimes believe things and say things with a kind of absolutism that will be foreign to them later in their life. And that’s in part what gives university communities their character—the stage of life of a very big part of their population. Oh, gosh, it’s always hard to say what kind of advice you would give somebody you don’t know. But I think in part what has happened is when you’re in one of these jobs for a while, you have relationships. I certainly have alumni who have felt that my statements haven’t gone far enough, who have been very, very distressed by what’s happening on campus—but they tend to call me up. When you have relationships, it becomes in some ways easier to have the conversation, because you have some credibility with people. What I always say is “Listen—you’ll learn from what you hear.” I certainly have learned from listening to our Jewish students, from listening to our Palestinian and Muslim students. And what I hear, paradoxically, both groups saying is “See my pain. See where I am.” Both groups to a certain extent feel unseen, either on the particular campus or, more generally, in the world. I think the task for us all is to try to figure out how we can bring together people of sharply differing views, and have them talk to each other with civility and respect. We had two faculty members here, Ron Hassner and Hatem Bazian, and they wrote together to their students, saying, We disagree about everything; we vehemently disagree, but we have always treated each other with civility and respect, and this is what we are asking of you. One of the things that really struck me when I got to Smith is that something inappropriate, mean, prejudiced that one student might say to another in the dining hall could become a campus crisis like . There was very little separation between the private world and the institutional world. Here, if a student said something awful to another student in the dining hall—I’m sure it goes on, but you’d never know about it. At Berkeley, what there is is public space. People come here to protest because it gets in the newspaper. Places like Berkeley and Harvard, they make news. And they can serve as shorthand for an idea of an institution that people may want to use, for negative purposes or for positive purposes. So there’s a difference between public space and private space. I always thought, when I was at Smith, that I didn’t have enough public space, and at Berkeley, the public space overwhelms. It predominates. It’s the picture on Sproul Plaza. It’s the banner that’s hanging off the Campanile, rather than the conversation that should be happening between people who have different ideas about things. I think it’s wrong. We owe all of our students support both in getting through their education and then also finding a place of employment after their education. So I don’t think that that’s a very good pressure point. Obviously, when an employer hires somebody, they make lots of judgments. I do it all the time when I hire people. But to say in a blanket way you shouldn’t ever hire a student who holds this political belief—I don’t know. It rubs me the wrong way. It’s terrible. We don’t have a lot of control over those trucks; if they’re driving around the city streets, we can’t stop them. What I do is I’ve offered to write a letter of recommendation for any student who has been doxed in that way, if they are a student in good standing, to say they’re a student in good standing and say what I can about them. I can’t really speak for the people who have developed the suit, but I think the current terrible, tragic, violent situation has reactivated their opposition to student organizations that express preference about point of view in their speakers. I knew how critical it was to do whatever we had to to allow very conservative speakers to be able to speak on campus without being shouted down, without their event being cancelled, without riots happening. And so we took extraordinary measures. The first thing that I learned was how important it was to defend the rights of free speech, even when the person’s point of view—like Milo Yiannopoulos’s to me—was just abhorrent. Another thing that I learned was how important it was for the community to have the conversation about free speech. The community was highly critical of the way in which I brought in enough police presence to enable the next conservative speaker who was invited to campus to be able to speak—and so we had a free-speech commission, we had lots of hearings. One of the things that you learn as a leader of an institution like this is, what you have to do is in some way embed the conversation in the community by having the opportunity for a lot of people to have it and to have it with different views. I thought it was a real reputational damage. “Berkeley is a place where conservative speakers can’t speak.” It was not only damage in the eyes of a larger public but some of our alums said, “What is this? Why can’t a conservative speaker speak at Berkeley?” And then it just answers to my own principles for the university. The university is a place where you debate ideas. It’s not just a place where you hear the ideas that make you comfortable. You should hear the ideas that make you not so comfortable, or you should hear people argue them back and forth. If not us, where? And so making the conditions for that seems, to me, very important. Absolutely, students have to be safe—end sentence, full stop. And that means physically safe, and it also means safe from targeted harassment. Doxing. We have pretty robust complaint procedures for people who believe that they have been harassed or doxed. And we’re actually hiring lots of extra help to try to go through what has been a huge increase in the number of complaints we’ve been getting. We’ve also increased our investment in security, as well as using observers more who can intervene if something seems to be getting out of control. One of the things that is very troubling to me, although I guess it’s understandable, is the sense of intense fragility—that physical fragility and vulnerability that students feel. And what I want to say is, “The campus is a pretty safe place”—which it is, but then you have terrible incidents like the young man who was on the Stanford campus, or these three young men who were . And so there are incidents that I think reinforce the sense that students keep sharing with me that they don’t feel physically safe. When I was a student, we wanted to be independent! We didn’t want anything to do with the restrictions of an older generation. Now students want to be both psychologically and physically assured of their safety. I don’t know whether this has to do with maybe changes in parenting styles or what. However, I went to white-majority schools. Now our campuses are a lot more diverse, and I think that creates more fragility around the idea of belonging, which can bleed over into a sense of lack of safety. Also, this is a generation of students that grew up, through grammar school, with anti-bullying instruction. And so I think there is more sensitivity. But there’s also the permission that an online world gives to irresponsible speech—saying things that you would never say in person. I think there’s also been a huge shift since the pandemic. The kind of fragility that I’ve seen is much more pronounced since the pandemic. During Vietnam, there was this real sense of agency. Students discovered that young people could have a role in history—that was the overwhelming sense of the sixties, whether it was the civil-rights movement, or the protests against the Vietnam War, or the Third World college strike at Berkeley. When I compare what’s happening now, there seems to be almost a sense of helplessness. There’s this situation in the Middle East that it is so grievous in so many ways—so horrible to think about, so horrible to look at when you watch the news or read the newspaper. And people are angry; they feel angst. And they also feel a sense of real impotence about it. So it seems quite different in that regard than the protests of the sixties. It’s not enjoyable. But I understand the impulse of it. It’s a form of American activism. And so long as students pay attention to the , it’s a legitimate form of the expression of group social opinion. First of all, literature teaches you empathy. You can’t read novels without having to shift your empathy, your sympathy, your understanding of people coming from very, very different places. The book that I’m reading right now is —the title is “ ,” and it’s about his difficulty in being a Vietnamese immigrant, from a family that had seen a lot of suffering in Vietnam, in the United States. And of course there are parts of this book that make me uncomfortable, and there are parts that are deeply illuminating about that experience. And, being a professor of literature, you’re used to paying a lot of attention to words, and words have been so fundamental to this current crisis. You mentioned before Steven Davidoff Solomon’s op-ed in the . Just in the past two or three days, there’s been by another one of our faculty, Ron Hassner, and it’s about “from the river to the sea.” And it’s really interesting. One of the points he makes is that some students—and I’ve learned this from talking with students—don’t understand it the way some Jews understand it. One of the things I certainly have learned from this crisis is that there are certainly moral absolutes—there is nothing you can say that in any way rationalizes the barbarity of the Hamas attack on Israel. But people don’t always use words with the understanding of how they sound to someone else. And you see that all the time in an incredibly painful way in the current situation. I’m not at all calling for a moral relativism; I’m just saying that people aren’t hearing their words with the ears of another. And they’re often ignorant of the history that leaves those words to resonate in a certain way. While I will refrain from criticizing or second-guessing the presidents who appeared before Congress, the aftermath offers ample evidence of the perils and challenges higher education is facing at that intersection of free speech, diversity of perspective, and the essential import of civil discourse for strong campus communities. At Berkeley we have been grappling with some of these issues for years if only because as a public university we have far less discretion than private institutions when it comes to First Amendment compliance. At Berkeley we would strongly condemn any advocacy for genocide against the Jewish people. And our response to that hate speech would not stop with condemnation. This campus can and will discipline hate speech not protected by the First Amendment. Any speech not protected by the First Amendment would, by definition, violate the Student and Faculty Codes of Conduct. And, even if that hate speech was protected, it would not stop Berkeley from strongly condemning it and marshalling the university’s educational resources to address the evil and the ignorance at the heart of any call for genocide against the Jewish people. Yet, I am certain that even this commitment—which is as far as we can go under the law—will sound far from sufficient to some, and an unwarranted over-reaction to others. ♦", "pubDate": "2023-12-17 11:00:00", "image_url": "https://media.newyorker.com/photos/657a0740c6403b9c12507ea1/master/pass/Fischer-Carol-Christ-lead.jpg", "source_id": "newyorker", "source_priority": 776, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "98a28c4a38583a6d80154bc227d32fa8", "title": "Massive far-right event is reportedly packed with people who have 'a dim view of the Jews'", "link": "https://news.knowledia.com/US/en/articles/massive-far-right-event-is-reportedly-packed-with-people-who-have-a-dim-fbcb7af894929c061ca4d4c069d813fe8cadc14c?source=rss", "keywords": null, "creator": null, "video_url": null, "description": "A gathering of far-right personalities is reportedly expected to be packed with patriotism... and antisemitism.Turning Point USA's \"AmericaFest\" is kicking off on Saturday, but Rolling Stone has highlighted some of its more controversial acts.TPUSA is run by Charlie Kirk, who has himself been… - www.rawstory.com", "content": "A gathering of far-right personalities is reportedly expected to be packed with patriotism... and antisemitism. Turning Point USA's \"AmericaFest\" is kicking off on Saturday, but Rolling Stone has highlighted some of its more controversial acts. TPUSA is run by Charlie Kirk, who has himself been accused of \"creating 'an anti-Semite problem' for the right,\" according to the report. But it doesn't stop there. Here are some of the highlights from the reporting: \"AmericaFest will be kicked off Saturday night by Roseanne Barr — the far-right comedian, who this past summer not only voiced Holocaust denial, but made a call for violence against the Jewish people,\" according to the report. \"'Nobody died in the Holocaust,' Barr… David McAfee", "pubDate": "2023-12-17 10:52:49", "image_url": "https://www.rawstory.com/media-library/image.jpg?id=24841333&width=1200&height=600&coordinates=0%2C14%2C0%2C15", "source_id": "knowledia", "source_priority": 167779, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "22206e5e7fb3216db709cc66cd341192", "title": "Ex-Trump lawyer Jenna Ellis picks a surprising fight against Christian nationalism", "link": "https://news.knowledia.com/US/en/articles/ex-trump-lawyer-jenna-ellis-picks-a-surprising-fight-against-christian-7f79d6ef6a28d04b8718c935186822b23ffe5675?source=rss", "keywords": null, "creator": null, "video_url": null, "description": "Former Trump lawyer Jenna Ellis is a Republican Christian, but she wants you to know she's not a Christian nationalist.Ellis, who already pleaded guilty for her role in the Georgia election subversion scheme for which the former president is also fighting serious criminal charges, on Friday… - www.rawstory.com", "content": "Former Trump lawyer Jenna Ellis is a Republican Christian, but she wants you to know she's not a Christian nationalist. Ellis, who already pleaded guilty for her role in the Georgia election subversion scheme for which the former president is also fighting serious criminal charges, on Friday responded to a post by Turning Point USA Charlie Kirk. Kirk, who is battling allegations of antisemitism at his political conference, stated that a \"Christian veteran just beheaded a monument to Satan in Iowa's state Capitol.\" \"If this is Christian Nationalism, we need more of it. Hero,\" Kirk wrote on X. Ellis replied, choosing to take exception with Kirk's embrace of Christian nationalism. \"Christianity teaches that we war not against flesh and blood but against spiritual wickedness (Eph 6). The satanic statue had no more actual power than… David McAfee", "pubDate": "2023-12-17 10:52:49", "image_url": "https://www.rawstory.com/media-library/image.jpg?id=31799599&width=1200&height=600&coordinates=0%2C25%2C0%2C25", "source_id": "knowledia", "source_priority": 167779, "country": ["united states of america"], "category": ["top"], "language": "english"}, {"article_id": "d836053641abea8b8fdd360cfb6189d0", "title": "Georgia teacher accused of threatening to behead Muslim girl for calling his Israeli flag offensive", "link": "https://www.foxnews.com/us/georgia-teacher-accused-threatening-behead-muslim-girl-calling-his-israeli-flag-offensive", "keywords": ["f34a4268-f28c-5d57-a1a7-00ec8c6e04a2", "fnc", "Fox News", "fox-news/world/world-regions/israel", "fox-news/us/us-regions/southeast/georgia", "fox-news/us", "fox-news/us/crime", "fox-news/us/crime/police-and-law-enforcement", "fox-news/world/conflicts", "fox-news/us/education", "fox-news/us", "article"], "creator": null, "video_url": null, "description": "A middle school teacher in Georgia was arrested after he allegedly made threats toward a Muslim student who objected to an Israeli flag he had in his classroom.", "content": "close Video Fox News Flash top headlines for December 16 Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com. A Georgia middle school teacher was arrested after allegedly threatening to cut off the head of a Muslim student who confronted him about an Israeli flag in his classroom. Benjamin Reese, 51, a seventh-grade social studies teacher at Warner Robbins Middle School, was arrested on Dec. 8 on charges of making terroristic threats and cruelty to children, jail records show. He was released on bond two days later, but bond conditions require him to stay away from the school and the student he is accused of threatening. A girl approached Reese in a hallway and told him she found the Israeli flag in his classroom offensive because Israelis were killing Palestinians, according to an incident report. The student said Reese told her he was Jewish and has relatives in Israel, accused her of being antisemitic and began screaming threats toward her. Several witnesses reported hearing Reese scream threats, including one where he said he would cut the girl's head off. GEORGIA MOTHER SENTENCED 30 YEARS FOR SUBJECTING CHILDREN TO PHYSICAL ABUSE, EXTREME EXERCISE, LIMITED FOOD Benjamin Reese, 51, a seventh-grade social studies teacher at Warner Robbins Middle School, was arrested on Dec. 8 on charges of making terroristic threats and cruelty to children. (Google Maps) \"You motherf---ing piece of s---t! I’ll kick your a--! I should cut your motherf---ing head off!\" he reportedly screamed. Some students said they also heard Reese saying he would \"slit her goddamn throat and drag her a-- outside and cut her head off.\" A faculty member heard Reese saying, \"You don’t make an antisemitic comment like that to a Jew.\" The student responded negatively to his comments, but she did not shout, according to the report. When a deputy asked Reese if he threatened any students, he denied the allegations, the report said. He said he told a student who was offended by the flag that she was being antisemitic but denied saying anything racist to her. Reese then said he had nothing further to say and \"invoked his civil rights,\" according to the report. GEORGIA COULD SEE OVERHAUL OF A-TO-F GRADING SYSTEM IN SCHOOLS Bond conditions require the teacher to stay away from the school and the student he is accused of threatening. (Houston County Sheriff's Office) Surveillance video showed Reese shouting before walking back to his classroom, but the video did not have audio, WMAZ reported. A spokesperson for the Houston County School District said in a statement to WMAZ that employees are required to follow the Code of Ethics for Educators. CLICK HERE TO GET THE FOX NEWS APP \"If there is a violation or accusation of a violation, we investigate and respond appropriately. While we are not able to discuss specific personnel matters, we can share that Mr. Reese has not been on the campus of Warner Robins Middle School since Dec. 7, 2023,\" the statement read. The incident between Reese and the student comes amid heightened tensions around the world over the war in the Middle East between Israeli forces and Hamas terrorists. There have been numerous antisemitic and Islamophobic incidents reported since Hamas launched its attack against Israel on Oct. 7. The Associated Press contributed to this report.", "pubDate": "2023-12-17 10:18:29", "image_url": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/931/523/gamiddleschool.png?ve=1&tl=1", "source_id": "foxnews", "source_priority": 59, "country": ["united states of america"], "category": ["top"], "language": "english"}], "nextPage": "1702808309427459369"}