{"status": "success", "totalResults": 8, "results": [{"article_id": "3497767ce2b0a809bd78b0435cded625", "title": "Antisémitisme : Je suis le traître syrien récupéré par Israël, par Omar Youssef Souleimane", "link": "https://news.knowledia.com/FR/fr/articles/antisemitisme-je-suis-le-traitre-syrien-recupere-par-israel-par-omar-5254cd639d3eb1f1958736e0328e07bbefcfc662?source=rss", "keywords": null, "creator": null, "video_url": null, "description": "L'écrivain d'origine syrienne explique à quel point il est personnellement compliqué, pour un \"Arabe\", de dénoncer l'antisémitisme au Proche-Orient. - www.lexpress.fr", "content": "Un prix élevé doit être payé par ceux qui, d'origine arabe, abordent publiquement la question de la guerre entre Israël et le Hamas. Au Proche-Orient, quoi qu'on dise contre le Hamas, il ne faut pas surtout paraître favorable à l'Etat de Benyamin Netanyahou. En France, \"l'Arabe\" est sommé de choisir un camp entre Israël et Palestine. Depuis le 7 octobre, j'ai perdu la majorité de mes amis arabes. A leurs yeux, il ne faut pas dévoiler l'antisémitisme au Proche-Orient devant les Occidentaux, pour ne pas soutenir l'agenda sioniste. Surtout en pleine guerre israélo-palestinienne. Plusieurs m'ont envoyé des messages pour couper les ponts suite à la publication de mes textes sur la haine des juifs. Des articles ont été publiés en arabe, expliquant que je cherche à être connu, que je veux de l'argent, que je suis un traître. Le plus triste, c'est qu'avec certains de ces ex-amis, nous avions manifesté ensemble contre le régime de Bachar al-Assad en Syrie. Ils étaient mes camarades de la révolution syrienne, ils savent très bien que diaboliser Israël est une part essentielle de la propagande du régime pour rester au pouvoir, un épouvantail destiné à faire peur à la population. Là-bas, l'accusation la plus dangereuse était d'être qualifié d'\"agent d'Israël\" : elle valait condamnation à mort. Créer un ennemi à l'étranger, instaurer l'Etat d'urgence pour justifier tous les crimes commis contre son peuple, voilà un jeu dictatorial banal. Mais, dans le cas d'Israël, le sujet reste sensible même pour les opposants au régime, tant la haine contre ce pays est incrustée dans les esprits. Pour les croyants ou les athées, les chrétiens ou les musulmans, les djihadistes ou les communistes, les pro ou les anti-Assad, Israël demeure cet Etat \"colonialiste\" dont il faut se débarrasser. Une guerre absurde de plus de cent ans entre Arabes et juifs Dès le début de cette guerre, j'ai été menacé sur les réseaux sociaux. \"Je vais le trouver et je vais détruire son… L'Express", "pubDate": "2023-12-17 09:55:47", "image_url": "https://www.lexpress.fr/resizer/qbrPuJBl5laQFjmPf-JqwtRUisE=/1200x630/filters:focal(3590x1598:3600x1608)/cloudfront-eu-central-1.images.arcpublishing.com/lexpress/5OJACKLAOZFMRNPWAB2EB4QQPA.jpg", "source_id": "knowledia", "source_priority": 167779, "country": ["france"], "category": ["top"], "language": "french"}, {"article_id": "69661ea330bfe53f3f7fd192bf9577ac", "title": "Politique : \"Le projet d'Emmanuel Macron ne tient plus la route\", fustige Daniel Cohn-Bendit", "link": "https://www.francetvinfo.fr/politique/emmanuel-macron/politique-le-projet-d-emmanuel-macron-ne-tient-plus-la-route-fustige-daniel-cohn-bendit_6249942.html#xtor=RSS-3-[politique]", "keywords": null, "creator": null, "video_url": null, "description": "Daniel Cohn-Bendit invite aussi sur France Inter la gauche à \"s'émanciper de La France insoumise, surtout de Jean-Luc Mélenchon\".", "content": "\"Le projet d'Emmanuel Macron ne tient plus la route, ça ne fonctionne pas\" , fustige dimanche 17 décembre sur France Inter l'ancien eurodéputé Daniel Cohn-Bendit. Soutien de la première heure d'Emmanuel Macron, l'écologiste prend ses distances avec le chef de l'Etat qui n'est pas parvenu, selon lui, à \"dépasser\" le clivage gauche-droite. \"Il est temps de trouver une autre perspective politique, parce que pour l'instant la politique en France et la politique du Président s'enfoncent et on ne voit pas très bien où tout cela peut déboucher\" , avance Daniel Cohn-Bendit. à lire aussi Elections européennes 2024 : en hausse, le Rassemblement national est en tête des intentions de vote, selon un sondage L'ancien eurodéputé considère qu'il est \"trop simple de dire que [le parti d'Emmanuel Macron] bascule par la droite\" . Il rappelle qu'en 2017, Emmanuel Macron vantait la politique du \"en même temps, c'est-à-dire de dépasser une culture politique française délétère et terrible (...) qui ne permet pas, à la fin, de trouver politiquement des compromis\" . \"Il voulait la dépasser, et visiblement il n'y arrive pas\" , regrette Daniel Cohn-Bendit. LFI \"est l'incarnation du refus de faire de la politique Alors que les élections européennes doivent se tenir en juin 2024 , Daniel Cohn-Bendit apporte donc désormais son soutien à l'eurodéputé Place Publique Raphaël Glucksmann . \"Raphaël Glucksmann incarne quelque chose qui manque à la politique française, c'est-à-dire une culture de gauche réformiste qui est une synthèse écolo-socialo-humaniste.\" Daniel Cohn-Bendit à France Inter Pour l'ancien leader de Mai-68 , la France a \"aujourd'hui besoin\" d'une \"gauche réformiste qui sera capable, en proposant un programme innovant, de faire des coalitions et d'organiser une nouvelle majorité\" . Pour les Européennes, Daniel Cohn-Bendit brandit donc l'idée d'une liste commune \"menée par Raphaël Glucksmann\" afin de \"redonner de l'espoir à un électorat réformiste de gauche\" . Il estime que si cette \"nouvelle union à gauche\" réussit aux élections européennes, alors il faudra en tirer les leçons afin de \"relancer un nouveau cycle pour la gauche en France\" . Pour cela, Daniel Cohn-Bendit invite la gauche à \"s'émanciper de La France insoumise, surtout de Jean-Luc Mélenchon\" . L'écologiste accuse \"la politique de Jean-Luc Mélenchon\" d'être \"dangereuse\" . \"C'est un mélange de radicalisme, d'islamo-folie et d'antisémitisme\" , s'insurge-t-il. Pour Daniel Cohn-Bendit, le parti LFI \"est l'incarnation du refus de faire de la politique, c'est un radicalisme qui mène dans le mur\" .", "pubDate": "2023-12-17 09:27:25", "image_url": "https://www.francetvinfo.fr/pictures/dUaZplN49qUd7F4rQFqEIdGmxqk/432x243/2017/09/27/phpvJkpYS_1.png", "source_id": "francetvinfo", "source_priority": 50698, "country": ["france"], "category": ["politics"], "language": "french"}, {"article_id": "1ee77a2fd7718b5797cd8ab7811bc31b", "title": "Youcef Atal (Nice) jugé lundi pour provocation à la haine", "link": "https://www.lequipe.fr/Football/Actualites/Youcef-atal-nice-juge-lundi-pour-provocation-a-la-haine/1437432#xtor=RSS-1", "keywords": ["Foot, L1, Nice"], "creator": ["Vincent Villa"], "video_url": null, "description": "Le défenseur international algérien de Nice, Youcef Atal, sera jugé lundi pour provocation à la haine à raison de la religion.", "content": "Youcef Atal, joueur de l'OGC Nice, est convoqué lundi devant les juges pour provocation à la haine pour avoir partagé une vidéo appelant à un « jour noir » pour les juifs, après l'attaque sanglante du Hamas et le début des bombardements d'Israël sur Gaza. Son nom a déjà résonné vendredi dans la salle d'audience du tribunal correctionnel de Nice, où son ancien entraîneur , principalement contre les musulmans de l'équipe. Mais lundi, à partir de 13h30, le défenseur international algérien de 27 ans ne sera plus témoin mais prévenu. Côté parties civiles, la Licra (Ligue Internationale contre le racisme et l'antisémitisme) et l'Observatoire juif de France. Quelques jours après l'attaque sans précédent lancée par le Hamas en Israël le 7 octobre et le début des bombardements israéliens sur la bande de Gaza, et alors qu'il était en Algérie avec l'équipe nationale des « Fennecs », Youcef Atal avait partagé à ses 3,2 millions d'abonnés sur Instagram la vidéo à deux visages d'un prédicateur, Mahmoud Al Hasanat. Plusieurs responsables politiques avaient aussitôt dénoncé cette publication et le joueur l'avait . Mais, saisi par le préfet et le maire de Nice, le procureur de la République, Damien Martinelli, avait . Au départ, elle visait aussi le chef d'apologie du terrorisme. Suspendu par Nice depuis le 18 octobre Après examen de la vidéo et à l'issue d'une audition du joueur, , la justice n'avait finalement retenu que la provocation à la haine à raison de la religion. Depuis Atal est sous contrôle judiciaire, avec une caution de 80 000 euros et une interdiction de quitter le territoire national, sauf pour des motifs liés à son activité de footballeur professionnel. Mais cette activité est pour l'instant réduite. Dès le début du scandale, , Nice a en effet La commission de discipline de la Ligue de football professionnel avait ensuite formalisé la sanction en infligeant à Atal , qui s'achèveront après la réception de Lens mercredi lors de la 17e journée de Ligue 1.", "pubDate": "2023-12-16 16:18:34", "image_url": "https://medias.lequipe.fr/img-photo-jpg/youcef-atal-lors-de-la-victoire-des-aiglons-face-a-strasbourg-le-3-septembre-2-0-f-porcu-l-equipe/1500000001882264/0:171,1998:1170-665-335-70/9c184.jpg", "source_id": "lequipe", "source_priority": 21660, "country": ["france"], "category": ["sports"], "language": "french"}, {"article_id": "0b67845c5cbc359290aee49d88a1c62b", "title": "Elections européennes : le conflit israélo-palestinien n'affecte pas la dynamique électorale du RN", "link": "https://news.knowledia.com/FR/fr/articles/elections-europeennes-le-conflit-israelo-palestinien-n-affecte-pas-la-72ad5462f92d19264ab91d700419234f849b2703?source=rss", "keywords": null, "creator": null, "video_url": null, "description": "En s'invitant à la manifestation contre l'antisémitisme, et en soutenant la politique du gouvernement israélien, le Rassemblement national continue sa normalisation et cherche à rompre avec son héritage antisémite. Le parti utilise également le conflit pour marteler ses positions sur l'islam… - www.lemonde.fr", "content": "Les élections européennes de juin 2024 peuvent-elles être lues comme un test des ambitions présidentielles du Rassemblement national (RN) ? Depuis 2014, le parti a remporté chacun des scrutins européens sans toutefois transformer l'essai à l'élection nationale. L'histoire va-t-elle se répéter ? Commençons par un rappel qui vaut quasiment loi électorale : jamais le parti gagnant des élections européennes (à l'exception de la liste RPR-UDF conduite en 1994 par Dominique Baudis) n'a confirmé lors du scrutin présidentiel suivant. Si le RN arrive en tête en juin 2024, les augures ne seraient donc pas bons pour Marine Le Pen ou Jordan Bardella en 2027. Sauf que l'implantation forte du parti en France depuis les législatives de 2022 a rebattu les cartes. Et, contrairement à ce qu'on aurait pu penser, le conflit israélo-palestinien ne semble pas arrêter cette dynamique. L'enquête électorale réalisée par Ipsos-Sopra Steria en partenariat avec le Centre d'études de la vie politique française de Sciences Po (Cevipof) et Le Monde apporte à… Martial Foucault", "pubDate": "2023-12-16 11:13:58", "image_url": "https://img.lemde.fr/2023/12/15/362/0/4350/2175/1342/671/60/0/93779f3_1702657157160-cbi1155020.jpg", "source_id": "knowledia", "source_priority": 167779, "country": ["france"], "category": ["top"], "language": "french"}, {"article_id": "c695f8a0ed0ea46a840d4932f4a5ae57", "title": "Théâtre : trois pièces sensibles et utiles sur l’horreur de la Shoah", "link": "https://www.lepoint.fr/culture/theatre-trois-pieces-sensibles-et-utiles-sur-l-horreur-de-la-shoah-16-12-2023-2547290_3.php#xtor=RSS-221", "keywords": ["Culture"], "creator": null, "video_url": null, "description": "A l'heure ou l'antisemitisme refait surface, plusieurs metteurs en scene consacrent des spectacles aux pires heures de la persecution des juifs.", "content": "« J 'écris comme d'autres édifient des monuments pour honorer la mémoire de [mes] disparus », a écrit le dramaturge Jean-Claude Grumberg . L'homme de théâtre a ainsi multiplié, depuis un demi-siècle, les pièces qui évoquent le destin tragique des juifs lors de la Seconde Guerre mondiale. De Maman revient, pauvre orphelin (1974), où il décrivait les conditions dans lesquelles son père fut déporté à Auschwitz à La Plus Précieuse des marchandises (2018) qui narre, sur le mode du conte, cet épisode particulièrement sombre de notre histoire, en passant par L'Atelier (1979), Mon père, inventaire (2003) et Zone libre (1990), Jean-Claude Grumberg a passé sa vie à raconter « ce passé qui ne passe pas ». Dans son sillage, de nombreux auteurs de théâtre se sont penchés sur cette réalité. Tel Jean-Philippe Daguerre qui a signé Adieu, monsieur Haffman , adapté de la scène au cinéma en 2022. Ou encore Jean-Bernard Philippot qui, avec Résistance(s), a créé, en début d'année, une pièce racontant les efforts désespérés d'une poignée d'opposants au régime nazi. Cet hiver, d'autres auteurs reprennent le flambeau de la transmission. Trois pièces sont ainsi consacrées au sujet de la Shoah à travers l'Hexagone. À l'heure où les rescapés disparaissent les uns après les autres, le spectacle vivant prend ainsi le relais des témoins directs de ce drame. Cinq familles juives plongées dans la tourmente, une vingtaine de destins anéantis. À travers des lettres retrouvées dans les archives nationales, ces fameuses « suppliques » qui donnent son titre au spectacle, l'historien Laurent Joly ressuscite une poignée d'hommes et de femmes déportés dans les camps e ntre mars 1942 et août 1944 . Spécialiste de la dernière guerre, l'universitaire avait réalisé, en 2022, avec Jérôme Prieur, un documentaire sur ces courriers implorant le maréchal Pétain de laisser la vie sauve aux juifs raflés. Laurent Joly utilise aujourd'hui le même matériau pour conter les derniers jours d'hommes et de femmes cantonnés dans les antichambres de la mort que furent les camps de Drancy ou Pithiviers. À LIRE AUSSI Le destin brisé de Bernard Natan, tsar du cinéma français, Juif n°70902 Les histoires évoquées sont toutes poignantes. C'est Charlotte Lewin, 16 ans, qui écrit à l'administration française pour savoir ce qu'est devenue sa sœur Esther, internée à la cité de la Muette avec son fils et son père. C'est Gaston Lévy, ancien combattant de la Première Guerre, par ailleurs grand-père de François Truffaut, qui demande au gouvernement français de reconsidérer sa réglementation antisémite espérant que ses états de service militaire – il a été un héros de 14-18 – lui vaudront l'attention de Pétain. C'est aussi Léon Kacenelenbogen qui exprime simplement : « J'ai 20 ans et je veux vivre. » D'une étudiante voulant passer, en vain, l'oral du baccalauréat à une mère de famille dont la boutique de fruits et légumes est « aryanisée » – son fonds de commerce sera vendu à un épicier voisin et l'argent reviendra au commissariat aux questions juives la laissant dans le dénuement le plus total – en passant par une apprentie pharmacienne en butte à un fonctionnaire de police zélé… Les personnages centraux de chacun de ces récits rendent tangible la réalité que vécurent les juifs de France sous le régime de Vichy. Et le spectateur assiste, glacé, au déclenchement de froides procédures administratives où la mécanique inhumaine d'une machine bien huilée conduisit 75 721 personnes – dont près de 11 000 enfants – dans les trains. Destination : la mort. « Les Suppliques » , de Julie Bertin et Jade Herbulot (Le Birgit Ensemble) à partir du travail de l'historien Laurent Joly. Texte dit par Salomé Ayache, Marie Bunel, Pascal Cesari et Gilles Privat. Au Théâtre Gérard-Philippe, du lundi au vendredi à 20 heures, le samedi à 18 heures, le dimanche à 15 h 30, jusqu'au 17 décembre puis en tournée. Enseigner l'histoire grâce à un jeu vidéo ? L'idée peut paraître séduisante. Elle est au cœur de la conférence que donne Tala Haddad à des lycéens. La jeune femme présente ainsi une nouvelle application ludique à une classe quand l'expérience tourne court. Un bug informatique la contraint alors à livrer son histoire personnelle devant un public d'élèves d'abord amusés puis médusés par ce qu'elle leur confie. Il faut dire que le parcours de Tala a tout pour les sidérer. Née au Liban au lendemain de la guerre civile, cette femme pas tellement plus âgée que son public a développé un don : celui de parler aux maisons qui conservent la mémoire de leurs anciens habitants. En voyage à Amsterdam, Tala va ainsi découvrir l'histoire d'Anne Frank. Et le parcours de cette adolescente juive qui vit recluse pour échapper aux persécutions et mourra à Bergen-Belsen après avoir été dénoncée par un voisin la touche particulièrement. Passé l'effet de surprise, les spectateurs vont progressivement s'immerger dans une exploration de l'histoire du XX e siècle qui va multiplier les parallèles entre la guerre civile au Liban, la Seconde Guerre mondiale et la mémoire des génocides (Arméniens, Juifs et Tziganes, Tutsis). Portée en milieu scolaire par la comédienne Ada Harb qui insuffle au texte de Jana Klein et Stéphane Schoukroun une part de sa propre histoire, cette pièce étonnante conduit intelligemment le spectateur à s'interroger sur la place de la mémoire dans notre société, mais aussi à prendre conscience de l'aspect mortifère des discours négationnistes qui pullulent sur les réseaux sociaux. Chaque représentation est suivie par une séance de décryptage avec un enseignant d'histoire. Une manière de pousser collégiens et lycéens à dialoguer avec des adultes sur un sujet difficile mais, ô combien, important. « Décodage - Ados, Histoire et fake news » , spectacle tout public à partir de 14 ans de Jana Klein et Stéphane Schoukroun, avec Ada Harb. En tournée dans les établissements scolaires. Au retour des vacances d'été, trois enseignantes préparent la rentrée avec la directrice d'une école du 11 e arrondissement de Paris. Elles vérifient leur matériel, nettoient les pupitres et établissent la liste de leurs élèves en évoquant le programme qu'elles entendent traiter. Ces adultes attendent, avec impatience, de recevoir une trentaine d'élèves. Le lendemain, pourtant, de nombreux enfants ne se présentent pas. Où sont-ils passés ? Et comment faire classe sans élève ? Plongeant les spectateurs en septembre 1942, moins de deux mois après la rafle du Vél' d'Hiv , la nouvelle pièce de Xavier Lemaire et Pierre-Olivier Scotto examine, par-delà l'absurdité de la situation, la manière dont chacune de ces maîtresses fait face à l'événement. Alternant rires et larmes, ce spectacle explore, avec sensibilité, un épisode qui déborde de beaucoup les seules journées des 16 et 17 juillet 1942. Cette pièce servie par une brillante distribution rend palpable l'horreur de la déportation tout en maintenant, hors champ, la réalité indicible des camps. Une œuvre particulièrement utile par les temps qui courent. « Rentrée 42, bienvenue les enfants » , de Xavier Lemaire et Pierre-Olivier Scotto, avec Anne Richard, Isabelle Andréani, Émilie Chevrillon, Fanny Lucet, Michel Laliberté et Dominique Thomas. En tournée dans toute la France.", "pubDate": "2023-12-16 07:00:00", "image_url": "https://www.lepoint.fr/images/2023/12/16/25669920lpw-25720100-article-jpg_9986026.jpg", "source_id": "lepoint", "source_priority": 242783, "country": ["france"], "category": ["entertainment"], "language": "french"}, {"article_id": "31e8a66a90889a2682e10dfb872337ea", "title": "La gestion du ramadan au cœur du procès de Christophe Galtier", "link": "https://www.nicematin.com/justice/la-gestion-du-ramadanau-coeur-du-proces-galtier-891885", "keywords": null, "creator": null, "video_url": null, "description": "Accusé d’avoir écarté des joueurs en raison de leur pratique religieuse musulmane, l’ex-entraîneur de l’OGC Nice a contesté, ce vendredi en correctionnelle, toute discrimination. Le tribunal rendra son jugement le 21 décembre.", "content": "Christophe Galtier, entre deux matchs au Qatar où il s’est exilé, se présente ce vendredi matin au tribunal correctionnel de Nice. Flanqué de ses avocats, de son conseiller en communication, de son épouse et d’un couple d’amis, il fend une nuée de journalistes pour rejoindre la barre du tribunal correctionnel. Il doit répondre devant la justice de harcèlement moral et de discrimination. Mâchoire serrée, costume noir et chemise blanche, l’ex-entraîneur de Nice (2021-2022) et du PSG (2022) se prépare à une journée de tête à tête avec le président Alain Chemama. Le magistrat extrait les morceaux choisis de 75 auditions de témoins réalisées par la police judiciaire. Certains accusent l’entraîneur, souvent à mots couverts, de discrimination et de racisme. Beaucoup évoquent des on-dit, des propos rapportés. La plupart des témoignages sont plutôt en faveur de l’entraîneur. Me Sébastien Schapira dépose dès l’entame des débats, des conclusions pour annuler la procédure. Un prétexte pour attaquer bille en tête \"une enquête exclusivement à charge\" . Avec Me Olivier Martin, ils préviennent: ils plaideront la relaxe. Julien Fournier, l’ex-directeur général du club, par qui le scandale est arrivé, est absent. Tout comme les victimes du comportement supposé de Christophe Galtier. Pas de plainte, pas de partie civile. Seuls les avocats de la Licra (Ligue internationale contre le racisme et l’antisémitisme) et de la Ligue de football professionnel ont pris place pour réclamer respectivement 5000 euros et 1 euros de dommages et intérêts. L’OGC Nice a envoyé un courrier pour préciser qu’il s’en remettait à la sagesse du tribunal. Son enquête interne, elle, n’a officiellement rien donné. \"Sur la base d’un mail fabriqué par M. Fournier (ancien directeur du football à l’OGC Nice, Ndlr) , le parquet a ouvert une enquête. Cette enquête c’est du vent\" , dénonce avec énergie Me Schapira. Dante, 300 matches, capitaine de l’équipe, n’a même pas été entendu. Parce que c’est M. Fournier qui balade les enquêteurs, qui décide comment doit se dérouler l’enquête. » Pour résumer, Christophe Galtier se serait plaint du trop grand nombre de Noirs et de musulmans dans son effectif. Le mail de Julien Fournier adressé à un directeur d’Ineos, le propriétaire du club, fuite dans la presse et fait l’effet d’une bombe. Le prévenu conteste, parfois au bord des larmes, avoir tenu de tels propos. Ces accusations ont eu un retentissement considérable sur sa vie personnelle et la sécurité de ses proches. Ecarté par l’actionnaire, Julien Fournier en aurait-il voulu à Galtier avec lequel il entretenait des relations très tendues? Aurait-il instrumentalisé certains joueurs de confession musulmane pour discréditer Galtier? Le procureur de la République Damien Martinelli, qui a hérité d’une enquête lancée par son prédécesseur, répond sèchement à la défense sur la partialité supposée du parquet. \"Dans des dossiers de discrimination, qui peut être sournoise, on va entendre les personnes susceptibles d’avoir été discriminées. Il n’y a pas d’acharnement contre M. Galtier.\" Il est beaucoup question, tout au long des auditions, de la gestion du jeûne pendant une compétition. \"Je n’ai jamais écarté un joueur en raison de sa religion. Je n’ai été que dans la gestion de la performance\", martèle l’entraîneur, faisant appel à une diététicienne et à un médecin pour concilier le ramadan avec six rencontres à jouer. \"Je suis aussi responsable de la santé de mes joueurs, rappelle l’entraîneur. Je ne suis pas embêté que le joueur place la religion au-dessus du foot. Je suis embêté quand un joueur n’a pas mangé ou n’est pas hydraté pendant les 15 heures qui ont précédé le match.\"", "pubDate": "2023-12-16 05:45:00", "image_url": "https://fyooyzbm.filerobot.com/v7/protec/DATA_ART_12656430-H6YJrdPd.jpg?vh=8678bb&ci_seal=bf55d26f65&p=medium&v2&gravity=auto", "source_id": "nicematin", "source_priority": 1456058, "country": ["france"], "category": ["top"], "language": "french"}, {"article_id": "9f947fb6bc1177805a1d0859aa8ccd01", "title": "Serge Klarsfeld, le chasseur de nazis qui n’a plus peur du RN", "link": "https://www.lemonde.fr/m-le-mag/article/2023/12/16/serge-klarsfeld-le-chasseur-de-nazis-qui-n-a-plus-peur-du-rn_6206121_4500055.html", "keywords": null, "creator": null, "video_url": null, "description": "L’avocat historien a voué son existence à la mémoire de la Shoah. En traquant les anciens dignitaires nazis ainsi qu’en dénonçant avec constance une extrême droite française alors ouvertement antisémite. Pourtant, à 88 ans, le fils de déporté ne considère plus le RN comme un danger, mais comme un allié face au sentiment antijuif et à la menace de l’islamisme.", "content": "Sur un mur, un plan du camp d’­Auschwitz-Birkenau. Sur un autre, une petite toile ensoleillée de Florence. Serge et Beate Klarsfeld aimaient passer des vacances dans la cité toscane quand ils ne traquaient pas d’anciens dignitaires nazis. Mais tout, dans les bureaux qu’ils occupent au rez-de-chaussée d’un immeuble du 8 e arrondissement de Paris, raconte une vie consacrée à la mémoire des victimes de la Shoah. Des exemplaires du Mémorial de la déportation des Juifs de France (1978), leur livre monument – il pèse 7 kilos –, côtoient ceux de l’autre montagne qu’ils ont érigée, le Mémorial des enfants juifs déportés de France (1995). L’un a été le premier à répertorier les noms des 74 182 juifs déportés de l’Hexagone, l’autre à rendre leur humanité, en retraçant leurs courtes existences, aux 11 400 enfants juifs de France morts dans les camps. Serge Klarsfeld aurait pu être l’un d’entre eux si son père, Arno, ne s’était pas sacrifié en se rendant à la Gestapo, venue frapper à la porte de leur appartement niçois, la nuit du 30 septembre 1943. L’enfant était alors caché, avec sa mère et sa sœur, dans le double fond d’une armoire. Il avait 8 ans. Le vieil homme en a aujourd’hui 88 et il se tient droit, assis dans son fauteuil en cuir. Son épouse, Beate, 84 ans, court d’un bout à l’autre de l’appartement pour guider, en cette fin du mois de novembre, le chauffagiste de passage. Des coupures de presse punaisées derrière Serge Klarsfeld rappellent ce qu’a été l’existence du couple depuis leur rencontre, un jour de 1960, sur le quai du métro Porte-de-Saint-Cloud : la gifle infligée par la jeune militante allemande, en 1968, au chancelier Kurt Georg Kiesinger, ancien responsable de la propagande radiophonique hitlérienne ; le procès d’ex-dignitaires du III e Reich à Cologne, en 1979, durant lequel l’avocat défendit les parties civiles ; la traque rocambolesque, en Bolivie, du « boucher de Lyon », Klaus Barbie, chef de la Gestapo dans la capitale des Gaules, condamné à la perpétuité par la justice française, en 1987 ; les multiples procès intentés – et gagnés – pour antisémitisme contre Jean-Marie Le Pen… Une vie de roman, immortalisée par le téléfilm La Traque (2008), dans lequel Yvan Attal interprète le rôle de Serge Klarsfeld et dont l’affiche est placardée au mur, elle aussi. « Nous avons toujours, Beate et moi, combattu l’extrême droite antijuive », rappelle l’octogénaire d’une voix assurée. Le 16 avril 2022, le couple signait encore une tribune dans Libération pour appeler, lors de l’élection présidentielle, à faire barrage à Marine Le Pen, « fille du racisme et de l’antisémitisme » .", "pubDate": "2023-12-16 04:00:16", "image_url": "https://img.lemde.fr/2023/12/11/202/19/1086/543/644/322/60/0/bf36800_316488-3350666.jpg", "source_id": "lemonde", "source_priority": 12566, "country": ["france"], "category": ["politics"], "language": "french"}, {"article_id": "c4f370162bd4dcf382eb5c69e30d7c36", "title": "Guerre Hamas-Israël : « En appeler à la mémoire de la Shoah, c'est donner un faux tableau, dangereux, des causes de la violence »", "link": "https://news.knowledia.com/FR/fr/articles/guerre-hamas-israel-en-appeler-a-la-memoire-de-la-shoah-c-est-donner-c8b30212bed324431fbeec325c6a760af7af45e7?source=rss", "keywords": null, "creator": null, "video_url": null, "description": "Les comparaisons entre la crise israélo-palestinienne et le nazisme sont des « déroutes intellectuelles et morales », affirment seize chercheurs d'universités américaines, israéliennes et européennes, spécialistes de l'antisémitisme, dans une tribune débattue parue dans la « New York Review of… - www.lemonde.fr", "content": "Nous sommes des chercheurs travaillant dans diverses institutions sur la Shoah et l'antisémitisme. Nous tenons à faire part de notre consternation et de notre inquiétude devant la manière qu'ont des dirigeants politiques de premier plan et des personnalités publiques d'invoquer la mémoire de la Shoah afin d'expliquer la crise qui fait aujourd'hui rage à Gaza et en Israël. Sentiments de souffrance et de peur Les exemples d'une telle manière de faire sont nombreux : Gilad Erdan, l'ambassadeur d'Israël aux Nations unies, a porté [le 30 octobre] une étoile jaune sur sa poitrine affichant les mots « Plus jamais ça » alors qu'il s'adressait à l'Assemblée générale des Nations unies ; le président américain, Joe Biden, a déclaré que le Hamas avait « agi avec une barbarie aussi flagrante que lors de la Shoah » ; le premier ministre israélien, Benyamin Nétanyahou, a dit au chancelier allemand, Olaf Scholz, que «… Collectif", "pubDate": "2023-12-16 00:46:33", "image_url": "https://img.lemde.fr/2023/12/11/359/0/4312/2156/1342/671/60/0/cff4c0d_5093538-01-06.jpg", "source_id": "knowledia", "source_priority": 167779, "country": ["france"], "category": ["top"], "language": "french"}], "nextPage": null}